#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModioUICore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Modio_structs.hpp"
#include "ModioUICore_structs.hpp"


namespace SDK::Params
{

// Function ModioUICore.ModioModTagSelectorEntry.OnTagEntryClicked
// 0x0008 (0x0008 - 0x0000)
struct ModioModTagSelectorEntry_OnTagEntryClicked final
{
public:
	class UObject*                                ClickedObject;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModTagSelectorEntry_OnTagEntryClicked) == 0x000008, "Wrong alignment on ModioModTagSelectorEntry_OnTagEntryClicked");
static_assert(sizeof(ModioModTagSelectorEntry_OnTagEntryClicked) == 0x000008, "Wrong size on ModioModTagSelectorEntry_OnTagEntryClicked");
static_assert(offsetof(ModioModTagSelectorEntry_OnTagEntryClicked, ClickedObject) == 0x000000, "Member 'ModioModTagSelectorEntry_OnTagEntryClicked::ClickedObject' has a wrong offset!");

// Function ModioUICore.ModioModTagSelectorEntry.GetClickableWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagSelectorEntry_GetClickableWidget final
{
public:
	TScriptInterface<class IModioUIClickableWidget> ReturnValue;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModTagSelectorEntry_GetClickableWidget) == 0x000008, "Wrong alignment on ModioModTagSelectorEntry_GetClickableWidget");
static_assert(sizeof(ModioModTagSelectorEntry_GetClickableWidget) == 0x000010, "Wrong size on ModioModTagSelectorEntry_GetClickableWidget");
static_assert(offsetof(ModioModTagSelectorEntry_GetClickableWidget, ReturnValue) == 0x000000, "Member 'ModioModTagSelectorEntry_GetClickableWidget::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModTagSelectorEntry.GetSelectionWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagSelectorEntry_GetSelectionWidget final
{
public:
	TScriptInterface<class IModioUISelectableWidget> ReturnValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModTagSelectorEntry_GetSelectionWidget) == 0x000008, "Wrong alignment on ModioModTagSelectorEntry_GetSelectionWidget");
static_assert(sizeof(ModioModTagSelectorEntry_GetSelectionWidget) == 0x000010, "Wrong size on ModioModTagSelectorEntry_GetSelectionWidget");
static_assert(offsetof(ModioModTagSelectorEntry_GetSelectionWidget, ReturnValue) == 0x000000, "Member 'ModioModTagSelectorEntry_GetSelectionWidget::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModTagSelectorEntry.GetTagLabelWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagSelectorEntry_GetTagLabelWidget final
{
public:
	TScriptInterface<class IModioUIHasTextWidget> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModTagSelectorEntry_GetTagLabelWidget) == 0x000008, "Wrong alignment on ModioModTagSelectorEntry_GetTagLabelWidget");
static_assert(sizeof(ModioModTagSelectorEntry_GetTagLabelWidget) == 0x000010, "Wrong size on ModioModTagSelectorEntry_GetTagLabelWidget");
static_assert(offsetof(ModioModTagSelectorEntry_GetTagLabelWidget, ReturnValue) == 0x000000, "Member 'ModioModTagSelectorEntry_GetTagLabelWidget::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioActivatableWidget.AddActivationChangedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioActivatableWidget_AddActivationChangedHandler final
{
public:
	TDelegate<void(class UObject* ActivationContext, bool bIsActivated)> Handler;                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioActivatableWidget_AddActivationChangedHandler) == 0x000004, "Wrong alignment on ModioActivatableWidget_AddActivationChangedHandler");
static_assert(sizeof(ModioActivatableWidget_AddActivationChangedHandler) == 0x000010, "Wrong size on ModioActivatableWidget_AddActivationChangedHandler");
static_assert(offsetof(ModioActivatableWidget_AddActivationChangedHandler, Handler) == 0x000000, "Member 'ModioActivatableWidget_AddActivationChangedHandler::Handler' has a wrong offset!");

// Function ModioUICore.ModioActivatableWidget.RemoveActivationChangedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioActivatableWidget_RemoveActivationChangedHandler final
{
public:
	TDelegate<void(class UObject* ActivationContext, bool bIsActivated)> Handler;                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioActivatableWidget_RemoveActivationChangedHandler) == 0x000004, "Wrong alignment on ModioActivatableWidget_RemoveActivationChangedHandler");
static_assert(sizeof(ModioActivatableWidget_RemoveActivationChangedHandler) == 0x000010, "Wrong size on ModioActivatableWidget_RemoveActivationChangedHandler");
static_assert(offsetof(ModioActivatableWidget_RemoveActivationChangedHandler, Handler) == 0x000000, "Member 'ModioActivatableWidget_RemoveActivationChangedHandler::Handler' has a wrong offset!");

// Function ModioUICore.ModioEnumEntryUIDetails.GetEnumEntryDetails
// 0x0020 (0x0020 - 0x0000)
struct ModioEnumEntryUIDetails_GetEnumEntryDetails final
{
public:
	uint8                                         EnumValue;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   EnumValueDisplayText;                              // 0x0008(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioEnumEntryUIDetails_GetEnumEntryDetails) == 0x000008, "Wrong alignment on ModioEnumEntryUIDetails_GetEnumEntryDetails");
static_assert(sizeof(ModioEnumEntryUIDetails_GetEnumEntryDetails) == 0x000020, "Wrong size on ModioEnumEntryUIDetails_GetEnumEntryDetails");
static_assert(offsetof(ModioEnumEntryUIDetails_GetEnumEntryDetails, EnumValue) == 0x000000, "Member 'ModioEnumEntryUIDetails_GetEnumEntryDetails::EnumValue' has a wrong offset!");
static_assert(offsetof(ModioEnumEntryUIDetails_GetEnumEntryDetails, EnumValueDisplayText) == 0x000008, "Member 'ModioEnumEntryUIDetails_GetEnumEntryDetails::EnumValueDisplayText' has a wrong offset!");

// Function ModioUICore.ModioRetryLibrary.CanRetry
// 0x0008 (0x0008 - 0x0000)
struct ModioRetryLibrary_CanRetry final
{
public:
	struct FModioRetryCounter                     Target;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModioRetryLibrary_CanRetry) == 0x000004, "Wrong alignment on ModioRetryLibrary_CanRetry");
static_assert(sizeof(ModioRetryLibrary_CanRetry) == 0x000008, "Wrong size on ModioRetryLibrary_CanRetry");
static_assert(offsetof(ModioRetryLibrary_CanRetry, Target) == 0x000000, "Member 'ModioRetryLibrary_CanRetry::Target' has a wrong offset!");
static_assert(offsetof(ModioRetryLibrary_CanRetry, ReturnValue) == 0x000004, "Member 'ModioRetryLibrary_CanRetry::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioRetryLibrary.CanRetryAsExec
// 0x0008 (0x0008 - 0x0000)
struct ModioRetryLibrary_CanRetryAsExec final
{
public:
	struct FModioRetryCounter                     Target;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModioRetryLibrary_CanRetryAsExec) == 0x000004, "Wrong alignment on ModioRetryLibrary_CanRetryAsExec");
static_assert(sizeof(ModioRetryLibrary_CanRetryAsExec) == 0x000008, "Wrong size on ModioRetryLibrary_CanRetryAsExec");
static_assert(offsetof(ModioRetryLibrary_CanRetryAsExec, Target) == 0x000000, "Member 'ModioRetryLibrary_CanRetryAsExec::Target' has a wrong offset!");
static_assert(offsetof(ModioRetryLibrary_CanRetryAsExec, ReturnValue) == 0x000004, "Member 'ModioRetryLibrary_CanRetryAsExec::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioRetryLibrary.ResetRetryCount
// 0x0004 (0x0004 - 0x0000)
struct ModioRetryLibrary_ResetRetryCount final
{
public:
	struct FModioRetryCounter                     Target;                                            // 0x0000(0x0004)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioRetryLibrary_ResetRetryCount) == 0x000004, "Wrong alignment on ModioRetryLibrary_ResetRetryCount");
static_assert(sizeof(ModioRetryLibrary_ResetRetryCount) == 0x000004, "Wrong size on ModioRetryLibrary_ResetRetryCount");
static_assert(offsetof(ModioRetryLibrary_ResetRetryCount, Target) == 0x000000, "Member 'ModioRetryLibrary_ResetRetryCount::Target' has a wrong offset!");

// Function ModioUICore.ModioRetryLibrary.ResetRetryCountPure
// 0x0008 (0x0008 - 0x0000)
struct ModioRetryLibrary_ResetRetryCountPure final
{
public:
	struct FModioRetryCounter                     Target;                                            // 0x0000(0x0004)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FModioRetryCounter                     ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioRetryLibrary_ResetRetryCountPure) == 0x000004, "Wrong alignment on ModioRetryLibrary_ResetRetryCountPure");
static_assert(sizeof(ModioRetryLibrary_ResetRetryCountPure) == 0x000008, "Wrong size on ModioRetryLibrary_ResetRetryCountPure");
static_assert(offsetof(ModioRetryLibrary_ResetRetryCountPure, Target) == 0x000000, "Member 'ModioRetryLibrary_ResetRetryCountPure::Target' has a wrong offset!");
static_assert(offsetof(ModioRetryLibrary_ResetRetryCountPure, ReturnValue) == 0x000004, "Member 'ModioRetryLibrary_ResetRetryCountPure::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioRetryLibrary.Retry
// 0x0008 (0x0008 - 0x0000)
struct ModioRetryLibrary_Retry final
{
public:
	struct FModioRetryCounter                     Target;                                            // 0x0000(0x0004)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModioRetryLibrary_Retry) == 0x000004, "Wrong alignment on ModioRetryLibrary_Retry");
static_assert(sizeof(ModioRetryLibrary_Retry) == 0x000008, "Wrong size on ModioRetryLibrary_Retry");
static_assert(offsetof(ModioRetryLibrary_Retry, Target) == 0x000000, "Member 'ModioRetryLibrary_Retry::Target' has a wrong offset!");
static_assert(offsetof(ModioRetryLibrary_Retry, ReturnValue) == 0x000004, "Member 'ModioRetryLibrary_Retry::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioFocusableWidget.AddFocusPathChangedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioFocusableWidget_AddFocusPathChangedHandler final
{
public:
	TDelegate<void(class UObject* FocusContext, const struct FFocusEvent& InFocusEvent, bool bIsFocused)> Handler; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioFocusableWidget_AddFocusPathChangedHandler) == 0x000004, "Wrong alignment on ModioFocusableWidget_AddFocusPathChangedHandler");
static_assert(sizeof(ModioFocusableWidget_AddFocusPathChangedHandler) == 0x000010, "Wrong size on ModioFocusableWidget_AddFocusPathChangedHandler");
static_assert(offsetof(ModioFocusableWidget_AddFocusPathChangedHandler, Handler) == 0x000000, "Member 'ModioFocusableWidget_AddFocusPathChangedHandler::Handler' has a wrong offset!");

// Function ModioUICore.ModioFocusableWidget.RemoveFocusPathChangedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioFocusableWidget_RemoveFocusPathChangedHandler final
{
public:
	TDelegate<void(class UObject* FocusContext, const struct FFocusEvent& InFocusEvent, bool bIsFocused)> Handler; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioFocusableWidget_RemoveFocusPathChangedHandler) == 0x000004, "Wrong alignment on ModioFocusableWidget_RemoveFocusPathChangedHandler");
static_assert(sizeof(ModioFocusableWidget_RemoveFocusPathChangedHandler) == 0x000010, "Wrong size on ModioFocusableWidget_RemoveFocusPathChangedHandler");
static_assert(offsetof(ModioFocusableWidget_RemoveFocusPathChangedHandler, Handler) == 0x000000, "Member 'ModioFocusableWidget_RemoveFocusPathChangedHandler::Handler' has a wrong offset!");

// Function ModioUICore.ModioFocusableWidget.GetWidgetToFocus
// 0x0010 (0x0010 - 0x0000)
struct ModioFocusableWidget_GetWidgetToFocus final
{
public:
	EUINavigation                                 NavigationType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioFocusableWidget_GetWidgetToFocus) == 0x000008, "Wrong alignment on ModioFocusableWidget_GetWidgetToFocus");
static_assert(sizeof(ModioFocusableWidget_GetWidgetToFocus) == 0x000010, "Wrong size on ModioFocusableWidget_GetWidgetToFocus");
static_assert(offsetof(ModioFocusableWidget_GetWidgetToFocus, NavigationType) == 0x000000, "Member 'ModioFocusableWidget_GetWidgetToFocus::NavigationType' has a wrong offset!");
static_assert(offsetof(ModioFocusableWidget_GetWidgetToFocus, ReturnValue) == 0x000008, "Member 'ModioFocusableWidget_GetWidgetToFocus::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioGalleryImageUIDetails.GetImage
// 0x0010 (0x0010 - 0x0000)
struct ModioGalleryImageUIDetails_GetImage final
{
public:
	struct FModioImageWrapper                     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioGalleryImageUIDetails_GetImage) == 0x000008, "Wrong alignment on ModioGalleryImageUIDetails_GetImage");
static_assert(sizeof(ModioGalleryImageUIDetails_GetImage) == 0x000010, "Wrong size on ModioGalleryImageUIDetails_GetImage");
static_assert(offsetof(ModioGalleryImageUIDetails_GetImage, ReturnValue) == 0x000000, "Member 'ModioGalleryImageUIDetails_GetImage::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioGalleryImageUIDetails.GetIndex
// 0x0004 (0x0004 - 0x0000)
struct ModioGalleryImageUIDetails_GetIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioGalleryImageUIDetails_GetIndex) == 0x000004, "Wrong alignment on ModioGalleryImageUIDetails_GetIndex");
static_assert(sizeof(ModioGalleryImageUIDetails_GetIndex) == 0x000004, "Wrong size on ModioGalleryImageUIDetails_GetIndex");
static_assert(offsetof(ModioGalleryImageUIDetails_GetIndex, ReturnValue) == 0x000000, "Member 'ModioGalleryImageUIDetails_GetIndex::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModDependencyUIDetails.GetModDependency
// 0x00F8 (0x00F8 - 0x0000)
struct ModioModDependencyUIDetails_GetModDependency final
{
public:
	struct FModioModDependency                    ReturnValue;                                       // 0x0000(0x00F8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModDependencyUIDetails_GetModDependency) == 0x000008, "Wrong alignment on ModioModDependencyUIDetails_GetModDependency");
static_assert(sizeof(ModioModDependencyUIDetails_GetModDependency) == 0x0000F8, "Wrong size on ModioModDependencyUIDetails_GetModDependency");
static_assert(offsetof(ModioModDependencyUIDetails_GetModDependency, ReturnValue) == 0x000000, "Member 'ModioModDependencyUIDetails_GetModDependency::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModDependencyUIDetails.GetModID
// 0x0008 (0x0008 - 0x0000)
struct ModioModDependencyUIDetails_GetModID final
{
public:
	struct FModioModID                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModDependencyUIDetails_GetModID) == 0x000008, "Wrong alignment on ModioModDependencyUIDetails_GetModID");
static_assert(sizeof(ModioModDependencyUIDetails_GetModID) == 0x000008, "Wrong size on ModioModDependencyUIDetails_GetModID");
static_assert(offsetof(ModioModDependencyUIDetails_GetModID, ReturnValue) == 0x000000, "Member 'ModioModDependencyUIDetails_GetModID::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModFilterUIDetails.GetFilterName
// 0x0020 (0x0020 - 0x0000)
struct ModioModFilterUIDetails_GetFilterName final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModioModFilterUIDetails_GetFilterName) == 0x000008, "Wrong alignment on ModioModFilterUIDetails_GetFilterName");
static_assert(sizeof(ModioModFilterUIDetails_GetFilterName) == 0x000020, "Wrong size on ModioModFilterUIDetails_GetFilterName");
static_assert(offsetof(ModioModFilterUIDetails_GetFilterName, Name_0) == 0x000000, "Member 'ModioModFilterUIDetails_GetFilterName::Name_0' has a wrong offset!");
static_assert(offsetof(ModioModFilterUIDetails_GetFilterName, ReturnValue) == 0x000018, "Member 'ModioModFilterUIDetails_GetFilterName::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModFilterUIDetails.GetFilterParams
// 0x00B8 (0x00B8 - 0x0000)
struct ModioModFilterUIDetails_GetFilterParams final
{
public:
	struct FModioFilterParams                     ReturnValue;                                       // 0x0000(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModFilterUIDetails_GetFilterParams) == 0x000008, "Wrong alignment on ModioModFilterUIDetails_GetFilterParams");
static_assert(sizeof(ModioModFilterUIDetails_GetFilterParams) == 0x0000B8, "Wrong size on ModioModFilterUIDetails_GetFilterParams");
static_assert(offsetof(ModioModFilterUIDetails_GetFilterParams, ReturnValue) == 0x000000, "Member 'ModioModFilterUIDetails_GetFilterParams::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModTagSelector.GetMenuToggleClickableWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagSelector_GetMenuToggleClickableWidget final
{
public:
	TScriptInterface<class IModioUIClickableWidget> ReturnValue;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModTagSelector_GetMenuToggleClickableWidget) == 0x000008, "Wrong alignment on ModioModTagSelector_GetMenuToggleClickableWidget");
static_assert(sizeof(ModioModTagSelector_GetMenuToggleClickableWidget) == 0x000010, "Wrong size on ModioModTagSelector_GetMenuToggleClickableWidget");
static_assert(offsetof(ModioModTagSelector_GetMenuToggleClickableWidget, ReturnValue) == 0x000000, "Member 'ModioModTagSelector_GetMenuToggleClickableWidget::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModTagSelector.GetSelectorMenuWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagSelector_GetSelectorMenuWidget final
{
public:
	TScriptInterface<class IModioUIModTagSelector> ReturnValue;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModTagSelector_GetSelectorMenuWidget) == 0x000008, "Wrong alignment on ModioModTagSelector_GetSelectorMenuWidget");
static_assert(sizeof(ModioModTagSelector_GetSelectorMenuWidget) == 0x000010, "Wrong size on ModioModTagSelector_GetSelectorMenuWidget");
static_assert(offsetof(ModioModTagSelector_GetSelectorMenuWidget, ReturnValue) == 0x000000, "Member 'ModioModTagSelector_GetSelectorMenuWidget::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModInfoUIDetails.GetFullModInfo
// 0x01E8 (0x01E8 - 0x0000)
struct ModioModInfoUIDetails_GetFullModInfo final
{
public:
	struct FModioModInfo                          ReturnValue;                                       // 0x0000(0x01E8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModInfoUIDetails_GetFullModInfo) == 0x000008, "Wrong alignment on ModioModInfoUIDetails_GetFullModInfo");
static_assert(sizeof(ModioModInfoUIDetails_GetFullModInfo) == 0x0001E8, "Wrong size on ModioModInfoUIDetails_GetFullModInfo");
static_assert(offsetof(ModioModInfoUIDetails_GetFullModInfo, ReturnValue) == 0x000000, "Member 'ModioModInfoUIDetails_GetFullModInfo::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModInfoUIDetails.GetModID
// 0x0008 (0x0008 - 0x0000)
struct ModioModInfoUIDetails_GetModID final
{
public:
	struct FModioModID                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModInfoUIDetails_GetModID) == 0x000008, "Wrong alignment on ModioModInfoUIDetails_GetModID");
static_assert(sizeof(ModioModInfoUIDetails_GetModID) == 0x000008, "Wrong size on ModioModInfoUIDetails_GetModID");
static_assert(offsetof(ModioModInfoUIDetails_GetModID, ReturnValue) == 0x000000, "Member 'ModioModInfoUIDetails_GetModID::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModTagUIDetails.GetLocalizedText
// 0x0018 (0x0018 - 0x0000)
struct ModioModTagUIDetails_GetLocalizedText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModTagUIDetails_GetLocalizedText) == 0x000008, "Wrong alignment on ModioModTagUIDetails_GetLocalizedText");
static_assert(sizeof(ModioModTagUIDetails_GetLocalizedText) == 0x000018, "Wrong size on ModioModTagUIDetails_GetLocalizedText");
static_assert(offsetof(ModioModTagUIDetails_GetLocalizedText, ReturnValue) == 0x000000, "Member 'ModioModTagUIDetails_GetLocalizedText::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModTagUIDetails.GetRawStringValue
// 0x0010 (0x0010 - 0x0000)
struct ModioModTagUIDetails_GetRawStringValue final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModTagUIDetails_GetRawStringValue) == 0x000008, "Wrong alignment on ModioModTagUIDetails_GetRawStringValue");
static_assert(sizeof(ModioModTagUIDetails_GetRawStringValue) == 0x000010, "Wrong size on ModioModTagUIDetails_GetRawStringValue");
static_assert(offsetof(ModioModTagUIDetails_GetRawStringValue, ReturnValue) == 0x000000, "Member 'ModioModTagUIDetails_GetRawStringValue::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModTagUIDetails.GetSelectionState
// 0x0001 (0x0001 - 0x0000)
struct ModioModTagUIDetails_GetSelectionState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModTagUIDetails_GetSelectionState) == 0x000001, "Wrong alignment on ModioModTagUIDetails_GetSelectionState");
static_assert(sizeof(ModioModTagUIDetails_GetSelectionState) == 0x000001, "Wrong size on ModioModTagUIDetails_GetSelectionState");
static_assert(offsetof(ModioModTagUIDetails_GetSelectionState, ReturnValue) == 0x000000, "Member 'ModioModTagUIDetails_GetSelectionState::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModTagUIDetails.SetSelectionState
// 0x0001 (0x0001 - 0x0000)
struct ModioModTagUIDetails_SetSelectionState final
{
public:
	bool                                          bNewSelectionState;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModTagUIDetails_SetSelectionState) == 0x000001, "Wrong alignment on ModioModTagUIDetails_SetSelectionState");
static_assert(sizeof(ModioModTagUIDetails_SetSelectionState) == 0x000001, "Wrong size on ModioModTagUIDetails_SetSelectionState");
static_assert(offsetof(ModioModTagUIDetails_SetSelectionState, bNewSelectionState) == 0x000000, "Member 'ModioModTagUIDetails_SetSelectionState::bNewSelectionState' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ApplyClassPathOverride
// 0x0068 (0x0068 - 0x0000)
struct PropertyOverridesLibrary_ApplyClassPathOverride final
{
public:
	struct FClassPathOverride                     Target;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         DefaultValue;                                      // 0x0028(0x0020)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         ReturnValue;                                       // 0x0048(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ApplyClassPathOverride) == 0x000008, "Wrong alignment on PropertyOverridesLibrary_ApplyClassPathOverride");
static_assert(sizeof(PropertyOverridesLibrary_ApplyClassPathOverride) == 0x000068, "Wrong size on PropertyOverridesLibrary_ApplyClassPathOverride");
static_assert(offsetof(PropertyOverridesLibrary_ApplyClassPathOverride, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ApplyClassPathOverride::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyClassPathOverride, DefaultValue) == 0x000028, "Member 'PropertyOverridesLibrary_ApplyClassPathOverride::DefaultValue' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyClassPathOverride, ReturnValue) == 0x000048, "Member 'PropertyOverridesLibrary_ApplyClassPathOverride::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ApplyClassPathOverride_Casted
// 0x0040 (0x0040 - 0x0000)
struct PropertyOverridesLibrary_ApplyClassPathOverride_Casted final
{
public:
	struct FClassPathOverride                     Target;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    BaseClass;                                         // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 DefaultValue;                                      // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ApplyClassPathOverride_Casted) == 0x000008, "Wrong alignment on PropertyOverridesLibrary_ApplyClassPathOverride_Casted");
static_assert(sizeof(PropertyOverridesLibrary_ApplyClassPathOverride_Casted) == 0x000040, "Wrong size on PropertyOverridesLibrary_ApplyClassPathOverride_Casted");
static_assert(offsetof(PropertyOverridesLibrary_ApplyClassPathOverride_Casted, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ApplyClassPathOverride_Casted::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyClassPathOverride_Casted, BaseClass) == 0x000028, "Member 'PropertyOverridesLibrary_ApplyClassPathOverride_Casted::BaseClass' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyClassPathOverride_Casted, DefaultValue) == 0x000030, "Member 'PropertyOverridesLibrary_ApplyClassPathOverride_Casted::DefaultValue' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyClassPathOverride_Casted, ReturnValue) == 0x000038, "Member 'PropertyOverridesLibrary_ApplyClassPathOverride_Casted::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ApplyFloatOverride
// 0x0010 (0x0010 - 0x0000)
struct PropertyOverridesLibrary_ApplyFloatOverride final
{
public:
	struct FFloatOverride                         Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DefaultValue;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ApplyFloatOverride) == 0x000004, "Wrong alignment on PropertyOverridesLibrary_ApplyFloatOverride");
static_assert(sizeof(PropertyOverridesLibrary_ApplyFloatOverride) == 0x000010, "Wrong size on PropertyOverridesLibrary_ApplyFloatOverride");
static_assert(offsetof(PropertyOverridesLibrary_ApplyFloatOverride, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ApplyFloatOverride::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyFloatOverride, DefaultValue) == 0x000008, "Member 'PropertyOverridesLibrary_ApplyFloatOverride::DefaultValue' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyFloatOverride, ReturnValue) == 0x00000C, "Member 'PropertyOverridesLibrary_ApplyFloatOverride::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ApplyFontInfoOverride
// 0x0110 (0x0110 - 0x0000)
struct PropertyOverridesLibrary_ApplyFontInfoOverride final
{
public:
	struct FSlateFontInfoOverride                 Target;                                            // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         DefaultValue;                                      // 0x0060(0x0058)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         ReturnValue;                                       // 0x00B8(0x0058)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ApplyFontInfoOverride) == 0x000008, "Wrong alignment on PropertyOverridesLibrary_ApplyFontInfoOverride");
static_assert(sizeof(PropertyOverridesLibrary_ApplyFontInfoOverride) == 0x000110, "Wrong size on PropertyOverridesLibrary_ApplyFontInfoOverride");
static_assert(offsetof(PropertyOverridesLibrary_ApplyFontInfoOverride, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ApplyFontInfoOverride::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyFontInfoOverride, DefaultValue) == 0x000060, "Member 'PropertyOverridesLibrary_ApplyFontInfoOverride::DefaultValue' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyFontInfoOverride, ReturnValue) == 0x0000B8, "Member 'PropertyOverridesLibrary_ApplyFontInfoOverride::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ApplyHAlignOverride
// 0x0004 (0x0004 - 0x0000)
struct PropertyOverridesLibrary_ApplyHAlignOverride final
{
public:
	struct FHAlignOverride                        Target;                                            // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          DefaultValue;                                      // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          ReturnValue;                                       // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ApplyHAlignOverride) == 0x000001, "Wrong alignment on PropertyOverridesLibrary_ApplyHAlignOverride");
static_assert(sizeof(PropertyOverridesLibrary_ApplyHAlignOverride) == 0x000004, "Wrong size on PropertyOverridesLibrary_ApplyHAlignOverride");
static_assert(offsetof(PropertyOverridesLibrary_ApplyHAlignOverride, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ApplyHAlignOverride::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyHAlignOverride, DefaultValue) == 0x000002, "Member 'PropertyOverridesLibrary_ApplyHAlignOverride::DefaultValue' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyHAlignOverride, ReturnValue) == 0x000003, "Member 'PropertyOverridesLibrary_ApplyHAlignOverride::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ApplyInputActionOverride
// 0x0038 (0x0038 - 0x0000)
struct PropertyOverridesLibrary_ApplyInputActionOverride final
{
public:
	struct FInputActionOverride                   Target;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    DefaultValue;                                      // 0x0018(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ApplyInputActionOverride) == 0x000008, "Wrong alignment on PropertyOverridesLibrary_ApplyInputActionOverride");
static_assert(sizeof(PropertyOverridesLibrary_ApplyInputActionOverride) == 0x000038, "Wrong size on PropertyOverridesLibrary_ApplyInputActionOverride");
static_assert(offsetof(PropertyOverridesLibrary_ApplyInputActionOverride, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ApplyInputActionOverride::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyInputActionOverride, DefaultValue) == 0x000018, "Member 'PropertyOverridesLibrary_ApplyInputActionOverride::DefaultValue' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyInputActionOverride, ReturnValue) == 0x000028, "Member 'PropertyOverridesLibrary_ApplyInputActionOverride::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ApplyIntOverride
// 0x0010 (0x0010 - 0x0000)
struct PropertyOverridesLibrary_ApplyIntOverride final
{
public:
	struct FIntegerOverride                       Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         DefaultValue;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ApplyIntOverride) == 0x000004, "Wrong alignment on PropertyOverridesLibrary_ApplyIntOverride");
static_assert(sizeof(PropertyOverridesLibrary_ApplyIntOverride) == 0x000010, "Wrong size on PropertyOverridesLibrary_ApplyIntOverride");
static_assert(offsetof(PropertyOverridesLibrary_ApplyIntOverride, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ApplyIntOverride::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyIntOverride, DefaultValue) == 0x000008, "Member 'PropertyOverridesLibrary_ApplyIntOverride::DefaultValue' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyIntOverride, ReturnValue) == 0x00000C, "Member 'PropertyOverridesLibrary_ApplyIntOverride::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ApplyTextOverride
// 0x0050 (0x0050 - 0x0000)
struct PropertyOverridesLibrary_ApplyTextOverride final
{
public:
	struct FTextOverride                          Target;                                            // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   DefaultValue;                                      // 0x0020(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0038(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ApplyTextOverride) == 0x000008, "Wrong alignment on PropertyOverridesLibrary_ApplyTextOverride");
static_assert(sizeof(PropertyOverridesLibrary_ApplyTextOverride) == 0x000050, "Wrong size on PropertyOverridesLibrary_ApplyTextOverride");
static_assert(offsetof(PropertyOverridesLibrary_ApplyTextOverride, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ApplyTextOverride::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyTextOverride, DefaultValue) == 0x000020, "Member 'PropertyOverridesLibrary_ApplyTextOverride::DefaultValue' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyTextOverride, ReturnValue) == 0x000038, "Member 'PropertyOverridesLibrary_ApplyTextOverride::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ApplyTextTransformOverride
// 0x0004 (0x0004 - 0x0000)
struct PropertyOverridesLibrary_ApplyTextTransformOverride final
{
public:
	struct FTextTransformOverride                 Target;                                            // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	ETextTransformPolicy                          DefaultValue;                                      // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextTransformPolicy                          ReturnValue;                                       // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ApplyTextTransformOverride) == 0x000001, "Wrong alignment on PropertyOverridesLibrary_ApplyTextTransformOverride");
static_assert(sizeof(PropertyOverridesLibrary_ApplyTextTransformOverride) == 0x000004, "Wrong size on PropertyOverridesLibrary_ApplyTextTransformOverride");
static_assert(offsetof(PropertyOverridesLibrary_ApplyTextTransformOverride, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ApplyTextTransformOverride::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyTextTransformOverride, DefaultValue) == 0x000002, "Member 'PropertyOverridesLibrary_ApplyTextTransformOverride::DefaultValue' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ApplyTextTransformOverride, ReturnValue) == 0x000003, "Member 'PropertyOverridesLibrary_ApplyTextTransformOverride::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ResolveClassPathOverride
// 0x0050 (0x0050 - 0x0000)
struct PropertyOverridesLibrary_ResolveClassPathOverride final
{
public:
	struct FClassPathOverride                     Target;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         ReturnValue;                                       // 0x0030(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ResolveClassPathOverride) == 0x000008, "Wrong alignment on PropertyOverridesLibrary_ResolveClassPathOverride");
static_assert(sizeof(PropertyOverridesLibrary_ResolveClassPathOverride) == 0x000050, "Wrong size on PropertyOverridesLibrary_ResolveClassPathOverride");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverride, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ResolveClassPathOverride::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverride, bOverrideSet) == 0x000028, "Member 'PropertyOverridesLibrary_ResolveClassPathOverride::bOverrideSet' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverride, ReturnValue) == 0x000030, "Member 'PropertyOverridesLibrary_ResolveClassPathOverride::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ResolveClassPathOverride_Casted
// 0x0040 (0x0040 - 0x0000)
struct PropertyOverridesLibrary_ResolveClassPathOverride_Casted final
{
public:
	struct FClassPathOverride                     Target;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    BaseClass;                                         // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ResolveClassPathOverride_Casted) == 0x000008, "Wrong alignment on PropertyOverridesLibrary_ResolveClassPathOverride_Casted");
static_assert(sizeof(PropertyOverridesLibrary_ResolveClassPathOverride_Casted) == 0x000040, "Wrong size on PropertyOverridesLibrary_ResolveClassPathOverride_Casted");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverride_Casted, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ResolveClassPathOverride_Casted::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverride_Casted, BaseClass) == 0x000028, "Member 'PropertyOverridesLibrary_ResolveClassPathOverride_Casted::BaseClass' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverride_Casted, bOverrideSet) == 0x000030, "Member 'PropertyOverridesLibrary_ResolveClassPathOverride_Casted::bOverrideSet' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverride_Casted, ReturnValue) == 0x000038, "Member 'PropertyOverridesLibrary_ResolveClassPathOverride_Casted::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ResolveClassPathOverrideAsExec
// 0x0050 (0x0050 - 0x0000)
struct PropertyOverridesLibrary_ResolveClassPathOverrideAsExec final
{
public:
	struct FClassPathOverride                     Target;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         ReturnValue;                                       // 0x0030(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ResolveClassPathOverrideAsExec) == 0x000008, "Wrong alignment on PropertyOverridesLibrary_ResolveClassPathOverrideAsExec");
static_assert(sizeof(PropertyOverridesLibrary_ResolveClassPathOverrideAsExec) == 0x000050, "Wrong size on PropertyOverridesLibrary_ResolveClassPathOverrideAsExec");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverrideAsExec, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ResolveClassPathOverrideAsExec::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverrideAsExec, bOverrideSet) == 0x000028, "Member 'PropertyOverridesLibrary_ResolveClassPathOverrideAsExec::bOverrideSet' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverrideAsExec, ReturnValue) == 0x000030, "Member 'PropertyOverridesLibrary_ResolveClassPathOverrideAsExec::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ResolveClassPathOverrideAsExec_Casted
// 0x0040 (0x0040 - 0x0000)
struct PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted final
{
public:
	struct FClassPathOverride                     Target;                                            // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    BaseClass;                                         // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted) == 0x000008, "Wrong alignment on PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted");
static_assert(sizeof(PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted) == 0x000040, "Wrong size on PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted, BaseClass) == 0x000028, "Member 'PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted::BaseClass' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted, bOverrideSet) == 0x000030, "Member 'PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted::bOverrideSet' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted, ReturnValue) == 0x000038, "Member 'PropertyOverridesLibrary_ResolveClassPathOverrideAsExec_Casted::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ResolveFloatOverride
// 0x0010 (0x0010 - 0x0000)
struct PropertyOverridesLibrary_ResolveFloatOverride final
{
public:
	struct FFloatOverride                         Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ResolveFloatOverride) == 0x000004, "Wrong alignment on PropertyOverridesLibrary_ResolveFloatOverride");
static_assert(sizeof(PropertyOverridesLibrary_ResolveFloatOverride) == 0x000010, "Wrong size on PropertyOverridesLibrary_ResolveFloatOverride");
static_assert(offsetof(PropertyOverridesLibrary_ResolveFloatOverride, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ResolveFloatOverride::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveFloatOverride, bOverrideSet) == 0x000008, "Member 'PropertyOverridesLibrary_ResolveFloatOverride::bOverrideSet' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveFloatOverride, ReturnValue) == 0x00000C, "Member 'PropertyOverridesLibrary_ResolveFloatOverride::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ResolveFloatOverrideAsExec
// 0x0010 (0x0010 - 0x0000)
struct PropertyOverridesLibrary_ResolveFloatOverrideAsExec final
{
public:
	struct FFloatOverride                         Target;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ResolveFloatOverrideAsExec) == 0x000004, "Wrong alignment on PropertyOverridesLibrary_ResolveFloatOverrideAsExec");
static_assert(sizeof(PropertyOverridesLibrary_ResolveFloatOverrideAsExec) == 0x000010, "Wrong size on PropertyOverridesLibrary_ResolveFloatOverrideAsExec");
static_assert(offsetof(PropertyOverridesLibrary_ResolveFloatOverrideAsExec, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ResolveFloatOverrideAsExec::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveFloatOverrideAsExec, bOverrideSet) == 0x000008, "Member 'PropertyOverridesLibrary_ResolveFloatOverrideAsExec::bOverrideSet' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveFloatOverrideAsExec, ReturnValue) == 0x00000C, "Member 'PropertyOverridesLibrary_ResolveFloatOverrideAsExec::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ResolveFontInfoOverride
// 0x00C0 (0x00C0 - 0x0000)
struct PropertyOverridesLibrary_ResolveFontInfoOverride final
{
public:
	struct FSlateFontInfoOverride                 Target;                                            // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         ReturnValue;                                       // 0x0068(0x0058)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ResolveFontInfoOverride) == 0x000008, "Wrong alignment on PropertyOverridesLibrary_ResolveFontInfoOverride");
static_assert(sizeof(PropertyOverridesLibrary_ResolveFontInfoOverride) == 0x0000C0, "Wrong size on PropertyOverridesLibrary_ResolveFontInfoOverride");
static_assert(offsetof(PropertyOverridesLibrary_ResolveFontInfoOverride, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ResolveFontInfoOverride::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveFontInfoOverride, bOverrideSet) == 0x000060, "Member 'PropertyOverridesLibrary_ResolveFontInfoOverride::bOverrideSet' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveFontInfoOverride, ReturnValue) == 0x000068, "Member 'PropertyOverridesLibrary_ResolveFontInfoOverride::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ResolveFontInfoOverrideAsExec
// 0x00C0 (0x00C0 - 0x0000)
struct PropertyOverridesLibrary_ResolveFontInfoOverrideAsExec final
{
public:
	struct FSlateFontInfoOverride                 Target;                                            // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         ReturnValue;                                       // 0x0068(0x0058)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PropertyOverridesLibrary_ResolveFontInfoOverrideAsExec) == 0x000008, "Wrong alignment on PropertyOverridesLibrary_ResolveFontInfoOverrideAsExec");
static_assert(sizeof(PropertyOverridesLibrary_ResolveFontInfoOverrideAsExec) == 0x0000C0, "Wrong size on PropertyOverridesLibrary_ResolveFontInfoOverrideAsExec");
static_assert(offsetof(PropertyOverridesLibrary_ResolveFontInfoOverrideAsExec, Target) == 0x000000, "Member 'PropertyOverridesLibrary_ResolveFontInfoOverrideAsExec::Target' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveFontInfoOverrideAsExec, bOverrideSet) == 0x000060, "Member 'PropertyOverridesLibrary_ResolveFontInfoOverrideAsExec::bOverrideSet' has a wrong offset!");
static_assert(offsetof(PropertyOverridesLibrary_ResolveFontInfoOverrideAsExec, ReturnValue) == 0x000068, "Member 'PropertyOverridesLibrary_ResolveFontInfoOverrideAsExec::ReturnValue' has a wrong offset!");

// Function ModioUICore.PropertyOverridesLibrary.ResolveHAlignOverride
// 0x0004 (0x0004 - 0x0000)
struct PropertyOverridesLibrary_ResolveHAlignOverride final
{
public:
	struct FHAlignOverride                        Target;                                            // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideSet;                                      // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
