#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModioUICore

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModioUICore_structs.hpp"
#include "Modio_structs.hpp"
#include "UMG_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class ModioUICore.ModioUIComponentBase
// 0x0060 (0x0470 - 0x0410)
class UModioUIComponentBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_410[0x38];                                     // 0x0410(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                DataSource;                                        // 0x0448(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UObject* ActivationContext, bool bIsActivated)> OnModioActivationChanged; // 0x0450(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UObject* FocusContext, const struct FFocusEvent& InFocusEvent, bool bIsFocused)> OnModioFocusPathChanged; // 0x0460(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIComponentBase">();
	}
	static class UModioUIComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioUIComponentBase>();
	}
};
static_assert(alignof(UModioUIComponentBase) == 0x000008, "Wrong alignment on UModioUIComponentBase");
static_assert(sizeof(UModioUIComponentBase) == 0x000470, "Wrong size on UModioUIComponentBase");
static_assert(offsetof(UModioUIComponentBase, DataSource) == 0x000448, "Member 'UModioUIComponentBase::DataSource' has a wrong offset!");
static_assert(offsetof(UModioUIComponentBase, OnModioActivationChanged) == 0x000450, "Member 'UModioUIComponentBase::OnModioActivationChanged' has a wrong offset!");
static_assert(offsetof(UModioUIComponentBase, OnModioFocusPathChanged) == 0x000460, "Member 'UModioUIComponentBase::OnModioFocusPathChanged' has a wrong offset!");

// Class ModioUICore.ModioModTagSelectorEntry
// 0x0048 (0x04B8 - 0x0470)
class UModioModTagSelectorEntry final : public UModioUIComponentBase
{
public:
	uint8                                         Pad_470[0x28];                                     // 0x0470(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UObject* SelectionContext, bool bNewSelectedState)> OnSelectionStateChanged; // 0x0498(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UObject* ClickContext)> OnClicked;                           // 0x04A8(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	void NotifyClicked();
	void NotifySelectionChanged();
	void OnTagEntryClicked(class UObject* ClickedObject);

	TScriptInterface<class IModioUIClickableWidget> GetClickableWidget() const;
	TScriptInterface<class IModioUISelectableWidget> GetSelectionWidget() const;
	TScriptInterface<class IModioUIHasTextWidget> GetTagLabelWidget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioModTagSelectorEntry">();
	}
	static class UModioModTagSelectorEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioModTagSelectorEntry>();
	}
};
static_assert(alignof(UModioModTagSelectorEntry) == 0x000008, "Wrong alignment on UModioModTagSelectorEntry");
static_assert(sizeof(UModioModTagSelectorEntry) == 0x0004B8, "Wrong size on UModioModTagSelectorEntry");
static_assert(offsetof(UModioModTagSelectorEntry, OnSelectionStateChanged) == 0x000498, "Member 'UModioModTagSelectorEntry::OnSelectionStateChanged' has a wrong offset!");
static_assert(offsetof(UModioModTagSelectorEntry, OnClicked) == 0x0004A8, "Member 'UModioModTagSelectorEntry::OnClicked' has a wrong offset!");

// Class ModioUICore.ModioActivatableWidget
// 0x0000 (0x0000 - 0x0000)
class IModioActivatableWidget final
{
public:
	void Activate();
	void AddActivationChangedHandler(const TDelegate<void(class UObject* ActivationContext, bool bIsActivated)>& Handler);
	void Deactivate();
	void RemoveActivationChangedHandler(const TDelegate<void(class UObject* ActivationContext, bool bIsActivated)>& Handler);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioActivatableWidget">();
	}
	static class IModioActivatableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioActivatableWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioActivatableWidget) == 0x000001, "Wrong alignment on IModioActivatableWidget");
static_assert(sizeof(IModioActivatableWidget) == 0x000001, "Wrong size on IModioActivatableWidget");

// Class ModioUICore.ModioEnumEntryUIDetails
// 0x0000 (0x0000 - 0x0000)
class IModioEnumEntryUIDetails final
{
public:
	void GetEnumEntryDetails(uint8* EnumValue, class FText* EnumValueDisplayText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioEnumEntryUIDetails">();
	}
	static class IModioEnumEntryUIDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioEnumEntryUIDetails>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioEnumEntryUIDetails) == 0x000001, "Wrong alignment on IModioEnumEntryUIDetails");
static_assert(sizeof(IModioEnumEntryUIDetails) == 0x000001, "Wrong size on IModioEnumEntryUIDetails");

// Class ModioUICore.ModioRetryLibrary
// 0x0000 (0x0028 - 0x0028)
class UModioRetryLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool CanRetry(const struct FModioRetryCounter& Target);
	static bool CanRetryAsExec(const struct FModioRetryCounter& Target);
	static void ResetRetryCount(struct FModioRetryCounter& Target);
	static struct FModioRetryCounter ResetRetryCountPure(struct FModioRetryCounter& Target);
	static bool Retry(struct FModioRetryCounter& Target);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioRetryLibrary">();
	}
	static class UModioRetryLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioRetryLibrary>();
	}
};
static_assert(alignof(UModioRetryLibrary) == 0x000008, "Wrong alignment on UModioRetryLibrary");
static_assert(sizeof(UModioRetryLibrary) == 0x000028, "Wrong size on UModioRetryLibrary");

// Class ModioUICore.ModioFocusableWidget
// 0x0000 (0x0000 - 0x0000)
class IModioFocusableWidget final
{
public:
	void AddFocusPathChangedHandler(const TDelegate<void(class UObject* FocusContext, const struct FFocusEvent& InFocusEvent, bool bIsFocused)>& Handler);
	void RemoveFocusPathChangedHandler(const TDelegate<void(class UObject* FocusContext, const struct FFocusEvent& InFocusEvent, bool bIsFocused)>& Handler);

	class UWidget* GetWidgetToFocus(EUINavigation NavigationType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioFocusableWidget">();
	}
	static class IModioFocusableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioFocusableWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioFocusableWidget) == 0x000001, "Wrong alignment on IModioFocusableWidget");
static_assert(sizeof(IModioFocusableWidget) == 0x000001, "Wrong size on IModioFocusableWidget");

// Class ModioUICore.ModioGalleryImageUIDetails
// 0x0000 (0x0000 - 0x0000)
class IModioGalleryImageUIDetails final
{
public:
	struct FModioImageWrapper GetImage();
	int32 GetIndex();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioGalleryImageUIDetails">();
	}
	static class IModioGalleryImageUIDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioGalleryImageUIDetails>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioGalleryImageUIDetails) == 0x000001, "Wrong alignment on IModioGalleryImageUIDetails");
static_assert(sizeof(IModioGalleryImageUIDetails) == 0x000001, "Wrong size on IModioGalleryImageUIDetails");

// Class ModioUICore.ModioPlatformSpecificWidget
// 0x0000 (0x0198 - 0x0198)
class UModioPlatformSpecificWidget final : public UContentWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioPlatformSpecificWidget">();
	}
	static class UModioPlatformSpecificWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioPlatformSpecificWidget>();
	}
};
static_assert(alignof(UModioPlatformSpecificWidget) == 0x000008, "Wrong alignment on UModioPlatformSpecificWidget");
static_assert(sizeof(UModioPlatformSpecificWidget) == 0x000198, "Wrong size on UModioPlatformSpecificWidget");

// Class ModioUICore.ModioModDependencyUIDetails
// 0x0000 (0x0000 - 0x0000)
class IModioModDependencyUIDetails final
{
public:
	struct FModioModDependency GetModDependency();
	struct FModioModID GetModID();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioModDependencyUIDetails">();
	}
	static class IModioModDependencyUIDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioModDependencyUIDetails>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioModDependencyUIDetails) == 0x000001, "Wrong alignment on IModioModDependencyUIDetails");
static_assert(sizeof(IModioModDependencyUIDetails) == 0x000001, "Wrong size on IModioModDependencyUIDetails");

// Class ModioUICore.ModioModFilterUIDetails
// 0x0000 (0x0000 - 0x0000)
class IModioModFilterUIDetails final
{
public:
	bool GetFilterName(class FText& Name_0);
	struct FModioFilterParams GetFilterParams();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioModFilterUIDetails">();
	}
	static class IModioModFilterUIDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioModFilterUIDetails>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioModFilterUIDetails) == 0x000001, "Wrong alignment on IModioModFilterUIDetails");
static_assert(sizeof(IModioModFilterUIDetails) == 0x000001, "Wrong size on IModioModFilterUIDetails");

// Class ModioUICore.ModioModTagSelector
// 0x0018 (0x0488 - 0x0470)
class UModioModTagSelector final : public UModioUIComponentBase
{
public:
	uint8                                         Pad_470[0x8];                                      // 0x0470(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IModioModTagOptionsUIDetails> CachedTagOptions;                           // 0x0478(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	TScriptInterface<class IModioUIClickableWidget> GetMenuToggleClickableWidget() const;
	TScriptInterface<class IModioUIModTagSelector> GetSelectorMenuWidget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioModTagSelector">();
	}
	static class UModioModTagSelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioModTagSelector>();
	}
};
static_assert(alignof(UModioModTagSelector) == 0x000008, "Wrong alignment on UModioModTagSelector");
static_assert(sizeof(UModioModTagSelector) == 0x000488, "Wrong size on UModioModTagSelector");
static_assert(offsetof(UModioModTagSelector, CachedTagOptions) == 0x000478, "Member 'UModioModTagSelector::CachedTagOptions' has a wrong offset!");

// Class ModioUICore.ModioModInfoUIDetails
// 0x0000 (0x0000 - 0x0000)
class IModioModInfoUIDetails final
{
public:
	struct FModioModInfo GetFullModInfo();
	struct FModioModID GetModID();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioModInfoUIDetails">();
	}
	static class IModioModInfoUIDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioModInfoUIDetails>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioModInfoUIDetails) == 0x000001, "Wrong alignment on IModioModInfoUIDetails");
static_assert(sizeof(IModioModInfoUIDetails) == 0x000001, "Wrong size on IModioModInfoUIDetails");

// Class ModioUICore.ModioModTagUIDetails
// 0x0000 (0x0000 - 0x0000)
class IModioModTagUIDetails final
{
public:
	class FText GetLocalizedText();
	class FString GetRawStringValue();
	bool GetSelectionState();
	void SetSelectionState(bool bNewSelectionState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioModTagUIDetails">();
	}
	static class IModioModTagUIDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioModTagUIDetails>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioModTagUIDetails) == 0x000001, "Wrong alignment on IModioModTagUIDetails");
static_assert(sizeof(IModioModTagUIDetails) == 0x000001, "Wrong size on IModioModTagUIDetails");

// Class ModioUICore.PropertyOverridesLibrary
// 0x0000 (0x0028 - 0x0028)
class UPropertyOverridesLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FSoftClassPath ApplyClassPathOverride(const struct FClassPathOverride& Target, const struct FSoftClassPath& DefaultValue);
	static class UClass* ApplyClassPathOverride_Casted(const struct FClassPathOverride& Target, TSubclassOf<class UObject> BaseClass, class UClass* DefaultValue);
	static float ApplyFloatOverride(const struct FFloatOverride& Target, float DefaultValue);
	static struct FSlateFontInfo ApplyFontInfoOverride(const struct FSlateFontInfoOverride& Target, const struct FSlateFontInfo& DefaultValue);
	static EHorizontalAlignment ApplyHAlignOverride(const struct FHAlignOverride& Target, EHorizontalAlignment DefaultValue);
	static struct FDataTableRowHandle ApplyInputActionOverride(const struct FInputActionOverride& Target, const struct FDataTableRowHandle& DefaultValue);
	static int32 ApplyIntOverride(const struct FIntegerOverride& Target, int32 DefaultValue);
	static class FText ApplyTextOverride(const struct FTextOverride& Target, const class FText& DefaultValue);
	static ETextTransformPolicy ApplyTextTransformOverride(const struct FTextTransformOverride& Target, ETextTransformPolicy DefaultValue);
	static struct FSoftClassPath ResolveClassPathOverride(const struct FClassPathOverride& Target, bool* bOverrideSet);
	static class UClass* ResolveClassPathOverride_Casted(const struct FClassPathOverride& Target, TSubclassOf<class UObject> BaseClass, bool* bOverrideSet);
	static struct FSoftClassPath ResolveClassPathOverrideAsExec(const struct FClassPathOverride& Target, bool* bOverrideSet);
	static class UClass* ResolveClassPathOverrideAsExec_Casted(const struct FClassPathOverride& Target, TSubclassOf<class UObject> BaseClass, bool* bOverrideSet);
	static float ResolveFloatOverride(const struct FFloatOverride& Target, bool* bOverrideSet);
	static float ResolveFloatOverrideAsExec(const struct FFloatOverride& Target, bool* bOverrideSet);
	static struct FSlateFontInfo ResolveFontInfoOverride(const struct FSlateFontInfoOverride& Target, bool* bOverrideSet);
	static struct FSlateFontInfo ResolveFontInfoOverrideAsExec(const struct FSlateFontInfoOverride& Target, bool* bOverrideSet);
	static EHorizontalAlignment ResolveHAlignOverride(const struct FHAlignOverride& Target, bool* bOverrideSet);
	static EHorizontalAlignment ResolveHAlignOverrideAsExec(const struct FHAlignOverride& Target, bool* bOverrideSet);
	static struct FDataTableRowHandle ResolveInputActionOverride(const struct FInputActionOverride& Target, bool* bOverrideSet);
	static struct FDataTableRowHandle ResolveInputActionOverrideAsExec(const struct FInputActionOverride& Target, bool* bOverrideSet);
	static int32 ResolveIntOverride(const struct FIntegerOverride& Target, bool* bOverrideSet);
	static int32 ResolveIntOverrideAsExec(const struct FIntegerOverride& Target, bool* bOverrideSet);
	static class FText ResolveTextOverride(const struct FTextOverride& Target, bool* bOverrideSet);
	static class FText ResolveTextOverrideAsExec(const struct FTextOverride& Target, bool* bOverrideSet);
	static ETextTransformPolicy ResolveTextTransformOverride(const struct FTextTransformOverride& Target, bool* bOverrideSet);
	static ETextTransformPolicy ResolveTextTransformOverrideAsExec(const struct FTextTransformOverride& Target, bool* bOverrideSet);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropertyOverridesLibrary">();
	}
	static class UPropertyOverridesLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyOverridesLibrary>();
	}
};
static_assert(alignof(UPropertyOverridesLibrary) == 0x000008, "Wrong alignment on UPropertyOverridesLibrary");
static_assert(sizeof(UPropertyOverridesLibrary) == 0x000028, "Wrong size on UPropertyOverridesLibrary");

// Class ModioUICore.ModioModTagCategoryUIDetails
// 0x0000 (0x0000 - 0x0000)
class IModioModTagCategoryUIDetails final
{
public:
	bool GetAllowMultipleSelection();
	TArray<TScriptInterface<class IModioModTagUIDetails>> GetCategoryTags();
	bool GetIsCategoryHidden();
	bool GetIsCategoryLocked();
	class FText GetLocalizedCategoryName();
	class FString GetRawCategoryName();
	TArray<class FString> GetSelectedTags();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioModTagCategoryUIDetails">();
	}
	static class IModioModTagCategoryUIDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioModTagCategoryUIDetails>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioModTagCategoryUIDetails) == 0x000001, "Wrong alignment on IModioModTagCategoryUIDetails");
static_assert(sizeof(IModioModTagCategoryUIDetails) == 0x000001, "Wrong size on IModioModTagCategoryUIDetails");

// Class ModioUICore.ModioModTagOptionsUIDetails
// 0x0000 (0x0000 - 0x0000)
class IModioModTagOptionsUIDetails final
{
public:
	void ClearSelectedTags();
	TArray<TScriptInterface<class IModioModTagCategoryUIDetails>> GetCategories();
	TArray<class FString> GetSelectedTags();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioModTagOptionsUIDetails">();
	}
	static class IModioModTagOptionsUIDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioModTagOptionsUIDetails>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioModTagOptionsUIDetails) == 0x000001, "Wrong alignment on IModioModTagOptionsUIDetails");
static_assert(sizeof(IModioModTagOptionsUIDetails) == 0x000001, "Wrong size on IModioModTagOptionsUIDetails");

// Class ModioUICore.ModioTokenPackBrowser
// 0x0030 (0x04A0 - 0x0470)
class UModioTokenPackBrowser final : public UModioUIComponentBase
{
public:
	uint8                                         Pad_470[0x30];                                     // 0x0470(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TScriptInterface<class IModioUIHasTextWidget> GetTitleTextWidget() const;
	TScriptInterface<class IModioUITokenPackListInterface> GetTokenTileViewWidget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioTokenPackBrowser">();
	}
	static class UModioTokenPackBrowser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioTokenPackBrowser>();
	}
};
static_assert(alignof(UModioTokenPackBrowser) == 0x000008, "Wrong alignment on UModioTokenPackBrowser");
static_assert(sizeof(UModioTokenPackBrowser) == 0x0004A0, "Wrong size on UModioTokenPackBrowser");

// Class ModioUICore.ModioScrollableWidget
// 0x0000 (0x0000 - 0x0000)
class IModioScrollableWidget final
{
public:
	void ScrollToBottom();
	void ScrollToTop();
	void SetScrollOffset(float Offset);

	float GetScrollOffset() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioScrollableWidget">();
	}
	static class IModioScrollableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioScrollableWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioScrollableWidget) == 0x000001, "Wrong alignment on IModioScrollableWidget");
static_assert(sizeof(IModioScrollableWidget) == 0x000001, "Wrong size on IModioScrollableWidget");

// Class ModioUICore.ModioToggleableWidget
// 0x0000 (0x0000 - 0x0000)
class IModioToggleableWidget final
{
public:
	void AddToggleStateChangedHandler(const TDelegate<void(class UObject* Context, bool bIsOpen)>& Handler);
	void Close();
	void Open(bool bForce, bool bFocusMenu);
	void RemoveToggleStateChangedHandler(const TDelegate<void(class UObject* Context, bool bIsOpen)>& Handler);

	bool IsOpen() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioToggleableWidget">();
	}
	static class IModioToggleableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioToggleableWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioToggleableWidget) == 0x000001, "Wrong alignment on IModioToggleableWidget");
static_assert(sizeof(IModioToggleableWidget) == 0x000001, "Wrong size on IModioToggleableWidget");

// Class ModioUICore.ModioStackedBoolLibrary
// 0x0000 (0x0028 - 0x0028)
class UModioStackedBoolLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool PeekBoolValue(const struct FModioStackedBool& Target, bool* bDidPeekSuccessfully);
	static bool PopBoolValue(struct FModioStackedBool& Target, bool* bDidPopSuccessfully);
	static void PushBoolValue(struct FModioStackedBool& Target, bool bNewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioStackedBoolLibrary">();
	}
	static class UModioStackedBoolLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioStackedBoolLibrary>();
	}
};
static_assert(alignof(UModioStackedBoolLibrary) == 0x000008, "Wrong alignment on UModioStackedBoolLibrary");
static_assert(sizeof(UModioStackedBoolLibrary) == 0x000028, "Wrong size on UModioStackedBoolLibrary");

// Class ModioUICore.ModioUIClickableWidget
// 0x0000 (0x0000 - 0x0000)
class IModioUIClickableWidget final
{
public:
	void AddClickedHandler(const TDelegate<void(class UObject* ClickContext)>& Handler);
	void DisableClick();
	void EnableClick();
	void RemoveClickedHandler(const TDelegate<void(class UObject* ClickContext)>& Handler);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIClickableWidget">();
	}
	static class IModioUIClickableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIClickableWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIClickableWidget) == 0x000001, "Wrong alignment on IModioUIClickableWidget");
static_assert(sizeof(IModioUIClickableWidget) == 0x000001, "Wrong size on IModioUIClickableWidget");

// Class ModioUICore.ModioUIBoundActionWidget
// 0x0000 (0x0000 - 0x0000)
class IModioUIBoundActionWidget final
{
public:
	void AddActionCompletedHandler(const TDelegate<void(const struct FDataTableRowHandle& BoundAction)>& Handler);
	void AddActionProgressHandler(const TDelegate<void(const struct FDataTableRowHandle& BoundAction, float Progress)>& Handler);
	void ClearBoundAction();
	void RemoveActionCompletedHandler(const TDelegate<void(const struct FDataTableRowHandle& BoundAction)>& Handler);
	void RemoveActionProgressHandler(const TDelegate<void(const struct FDataTableRowHandle& BoundAction, float Progress)>& Handler);
	void SetBoundAction(const struct FDataTableRowHandle& InputActionRow);

	bool TryGetBoundAction(struct FDataTableRowHandle* InputActionRow) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIBoundActionWidget">();
	}
	static class IModioUIBoundActionWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIBoundActionWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIBoundActionWidget) == 0x000001, "Wrong alignment on IModioUIBoundActionWidget");
static_assert(sizeof(IModioUIBoundActionWidget) == 0x000001, "Wrong size on IModioUIBoundActionWidget");

// Class ModioUICore.ModioPresetFilterEntryWidget
// 0x0020 (0x0490 - 0x0470)
class UModioPresetFilterEntryWidget final : public UModioUIComponentBase
{
public:
	uint8                                         Pad_470[0x20];                                     // 0x0470(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TScriptInterface<class IModioUIHasTextWidget> GetLabelWidget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioPresetFilterEntryWidget">();
	}
	static class UModioPresetFilterEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioPresetFilterEntryWidget>();
	}
};
static_assert(alignof(UModioPresetFilterEntryWidget) == 0x000008, "Wrong alignment on UModioPresetFilterEntryWidget");
static_assert(sizeof(UModioPresetFilterEntryWidget) == 0x000490, "Wrong size on UModioPresetFilterEntryWidget");

// Class ModioUICore.ModioUICommandMenu
// 0x0000 (0x0000 - 0x0000)
class IModioUICommandMenu final
{
public:
	void AddCommandListBuilder(const TDelegate<void(TArray<class UObject*>* CommandList, class UObject* Context)>& Builder);
	void RebuildCommandList();
	void RemoveCommandListBuilder(const TDelegate<void(TArray<class UObject*>* CommandList, class UObject* Context)>& Builder);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUICommandMenu">();
	}
	static class IModioUICommandMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUICommandMenu>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUICommandMenu) == 0x000001, "Wrong alignment on IModioUICommandMenu");
static_assert(sizeof(IModioUICommandMenu) == 0x000001, "Wrong size on IModioUICommandMenu");

// Class ModioUICore.ModioUICommandObject
// 0x0000 (0x0000 - 0x0000)
class IModioUICommandObject final
{
public:
	bool CanExecute(class UObject* Context);
	void Execute(class UObject* Context);
	struct FSlateBrush GetCommandBrush();
	class FText GetCommandDisplayString();
	void SetDataSource(class UObject* InDataSource);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUICommandObject">();
	}
	static class IModioUICommandObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUICommandObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUICommandObject) == 0x000001, "Wrong alignment on IModioUICommandObject");
static_assert(sizeof(IModioUICommandObject) == 0x000001, "Wrong size on IModioUICommandObject");

// Class ModioUICore.ModioModTagInfoUI
// 0x00E8 (0x0110 - 0x0028)
class UModioModTagInfoUI final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioModTagInfo                       Underlying;                                        // 0x0030(0x00B8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   LocalizedCategoryName;                             // 0x00E8(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class UModioModTagUI*>                 BindableTags;                                      // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioModTagInfoUI">();
	}
	static class UModioModTagInfoUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioModTagInfoUI>();
	}
};
static_assert(alignof(UModioModTagInfoUI) == 0x000008, "Wrong alignment on UModioModTagInfoUI");
static_assert(sizeof(UModioModTagInfoUI) == 0x000110, "Wrong size on UModioModTagInfoUI");
static_assert(offsetof(UModioModTagInfoUI, Underlying) == 0x000030, "Member 'UModioModTagInfoUI::Underlying' has a wrong offset!");
static_assert(offsetof(UModioModTagInfoUI, LocalizedCategoryName) == 0x0000E8, "Member 'UModioModTagInfoUI::LocalizedCategoryName' has a wrong offset!");
static_assert(offsetof(UModioModTagInfoUI, BindableTags) == 0x000100, "Member 'UModioModTagInfoUI::BindableTags' has a wrong offset!");

// Class ModioUICore.ModioUICommandLibrary
// 0x0000 (0x0028 - 0x0028)
class UModioUICommandLibrary final : public UBlueprintFunctionLibrary
{
public:
	static const struct FModioUICommandAssetEntry GetCommandAssetEntry(const class FString& CommandID, bool* bResolved);
	static const struct FSlateBrush GetCommandBrush(const class FString& CommandID, const class FName& BrushName, bool* bResolved);
	static const class FText GetCommandText(const class FString& CommandID, const class FName& TextName, bool* bResolved);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUICommandLibrary">();
	}
	static class UModioUICommandLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioUICommandLibrary>();
	}
};
static_assert(alignof(UModioUICommandLibrary) == 0x000008, "Wrong alignment on UModioUICommandLibrary");
static_assert(sizeof(UModioUICommandLibrary) == 0x000028, "Wrong size on UModioUICommandLibrary");

// Class ModioUICore.ModioUICommonButtonWidget
// 0x0000 (0x0000 - 0x0000)
class IModioUICommonButtonWidget final
{
public:
	void ConfigureCommonButton(const struct FModioCommonButtonParams& Params_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUICommonButtonWidget">();
	}
	static class IModioUICommonButtonWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUICommonButtonWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUICommonButtonWidget) == 0x000001, "Wrong alignment on IModioUICommonButtonWidget");
static_assert(sizeof(IModioUICommonButtonWidget) == 0x000001, "Wrong size on IModioUICommonButtonWidget");

// Class ModioUICore.ModioUIPurchaseModCommand
// 0x0010 (0x0038 - 0x0028)
class UModioUIPurchaseModCommand final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                DataSource;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIPurchaseModCommand">();
	}
	static class UModioUIPurchaseModCommand* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioUIPurchaseModCommand>();
	}
};
static_assert(alignof(UModioUIPurchaseModCommand) == 0x000008, "Wrong alignment on UModioUIPurchaseModCommand");
static_assert(sizeof(UModioUIPurchaseModCommand) == 0x000038, "Wrong size on UModioUIPurchaseModCommand");
static_assert(offsetof(UModioUIPurchaseModCommand, DataSource) == 0x000030, "Member 'UModioUIPurchaseModCommand::DataSource' has a wrong offset!");

// Class ModioUICore.ModioUIConnectivityChangedReceiver
// 0x0000 (0x0000 - 0x0000)
class IModioUIConnectivityChangedReceiver final
{
public:
	void OnConnectivityChanged(bool bNewConnectivityState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIConnectivityChangedReceiver">();
	}
	static class IModioUIConnectivityChangedReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIConnectivityChangedReceiver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIConnectivityChangedReceiver) == 0x000001, "Wrong alignment on IModioUIConnectivityChangedReceiver");
static_assert(sizeof(IModioUIConnectivityChangedReceiver) == 0x000001, "Wrong size on IModioUIConnectivityChangedReceiver");

// Class ModioUICore.ModioUIConnectivityChangedReceiverLibrary
// 0x0000 (0x0028 - 0x0028)
class UModioUIConnectivityChangedReceiverLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DeregisterConnectivityChangedReceiver(class UObject* ObjectToDeregister);
	static void RegisterConnectivityChangedReceiver(class UObject* ObjectToRegister);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIConnectivityChangedReceiverLibrary">();
	}
	static class UModioUIConnectivityChangedReceiverLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioUIConnectivityChangedReceiverLibrary>();
	}
};
static_assert(alignof(UModioUIConnectivityChangedReceiverLibrary) == 0x000008, "Wrong alignment on UModioUIConnectivityChangedReceiverLibrary");
static_assert(sizeof(UModioUIConnectivityChangedReceiverLibrary) == 0x000028, "Wrong size on UModioUIConnectivityChangedReceiverLibrary");

// Class ModioUICore.ModioTokenPackUIDetails
// 0x0000 (0x0000 - 0x0000)
class IModioTokenPackUIDetails final
{
public:
	struct FModioTokenPack GetFullTokenPack();
	struct FModioTokenPackID GetTokenPackID();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioTokenPackUIDetails">();
	}
	static class IModioTokenPackUIDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioTokenPackUIDetails>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioTokenPackUIDetails) == 0x000001, "Wrong alignment on IModioTokenPackUIDetails");
static_assert(sizeof(IModioTokenPackUIDetails) == 0x000001, "Wrong size on IModioTokenPackUIDetails");

// Class ModioUICore.ModioUIDataSourceWidget
// 0x0000 (0x0000 - 0x0000)
class IModioUIDataSourceWidget final
{
public:
	class UObject* GetDataSource();
	void SetDataSource(class UObject* InDataSource);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIDataSourceWidget">();
	}
	static class IModioUIDataSourceWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIDataSourceWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIDataSourceWidget) == 0x000001, "Wrong alignment on IModioUIDataSourceWidget");
static_assert(sizeof(IModioUIDataSourceWidget) == 0x000001, "Wrong size on IModioUIDataSourceWidget");

// Class ModioUICore.ModioUIDialog
// 0x0000 (0x0000 - 0x0000)
class IModioUIDialog final
{
public:
	void AddDialogButtonClickedHandler(const TDelegate<void(int32 ButtonIndex)>& Handler);
	void AddDialogCanceledHandler(const TDelegate<void()>& Handler);
	void AddDialogConfirmedHandler(const TDelegate<void()>& Handler);
	void AddDialogShownHandler(const TDelegate<void(bool bOpen)>& Handler);
	void CloseModal();
	void RemoveDialogButtonClickedHandler(const TDelegate<void(int32 ButtonIndex)>& Handler);
	void RemoveDialogCanceledHandler(const TDelegate<void()>& Handler);
	void RemoveDialogConfirmedHandler(const TDelegate<void()>& Handler);
	void RemoveDialogShownHandler(const TDelegate<void(bool bOpen)>& Handler);
	void ShowModal(bool bFocusCancelButton);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIDialog">();
	}
	static class IModioUIDialog* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIDialog>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIDialog) == 0x000001, "Wrong alignment on IModioUIDialog");
static_assert(sizeof(IModioUIDialog) == 0x000001, "Wrong size on IModioUIDialog");

// Class ModioUICore.ModioTagCounterIcon
// 0x0010 (0x0480 - 0x0470)
class UModioTagCounterIcon final : public UModioUIComponentBase
{
public:
	uint8                                         Pad_470[0x10];                                     // 0x0470(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TScriptInterface<class IModioUIHasTextWidget> GetCounterLabelWidget();
	int32 SynchronizeCounter();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioTagCounterIcon">();
	}
	static class UModioTagCounterIcon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioTagCounterIcon>();
	}
};
static_assert(alignof(UModioTagCounterIcon) == 0x000008, "Wrong alignment on UModioTagCounterIcon");
static_assert(sizeof(UModioTagCounterIcon) == 0x000480, "Wrong size on UModioTagCounterIcon");

// Class ModioUICore.ModioUIDialogDisplayEventReceiver
// 0x0000 (0x0000 - 0x0000)
class IModioUIDialogDisplayEventReceiver final
{
public:
	void OnDialogDisplayEvent(EModioUIDialogType DialogRequested, class UObject* DataSource);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIDialogDisplayEventReceiver">();
	}
	static class IModioUIDialogDisplayEventReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIDialogDisplayEventReceiver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIDialogDisplayEventReceiver) == 0x000001, "Wrong alignment on IModioUIDialogDisplayEventReceiver");
static_assert(sizeof(IModioUIDialogDisplayEventReceiver) == 0x000001, "Wrong size on IModioUIDialogDisplayEventReceiver");

// Class ModioUICore.ModioUIDialogDisplayEventReceiverLibrary
// 0x0000 (0x0028 - 0x0028)
class UModioUIDialogDisplayEventReceiverLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DeregisterDialogDisplayEventReceiver(class UObject* ObjectToDeregister);
	static void RegisterDialogDisplayEventReceiver(class UObject* ObjectToRegister);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIDialogDisplayEventReceiverLibrary">();
	}
	static class UModioUIDialogDisplayEventReceiverLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioUIDialogDisplayEventReceiverLibrary>();
	}
};
static_assert(alignof(UModioUIDialogDisplayEventReceiverLibrary) == 0x000008, "Wrong alignment on UModioUIDialogDisplayEventReceiverLibrary");
static_assert(sizeof(UModioUIDialogDisplayEventReceiverLibrary) == 0x000028, "Wrong size on UModioUIDialogDisplayEventReceiverLibrary");

// Class ModioUICore.ModioUIEntitlementRefreshEventReceiver
// 0x0000 (0x0000 - 0x0000)
class IModioUIEntitlementRefreshEventReceiver final
{
public:
	void OnEntitlementRefreshEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIEntitlementRefreshEventReceiver">();
	}
	static class IModioUIEntitlementRefreshEventReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIEntitlementRefreshEventReceiver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIEntitlementRefreshEventReceiver) == 0x000001, "Wrong alignment on IModioUIEntitlementRefreshEventReceiver");
static_assert(sizeof(IModioUIEntitlementRefreshEventReceiver) == 0x000001, "Wrong size on IModioUIEntitlementRefreshEventReceiver");

// Class ModioUICore.ModioUIEntitlementRefreshEventReceiverLibrary
// 0x0000 (0x0028 - 0x0028)
class UModioUIEntitlementRefreshEventReceiverLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DeregisterEntitlementRefreshEventReceiver(class UObject* ObjectToDeregister);
	static void RegisterEntitlementRefreshEventReceiver(class UObject* ObjectToRegister);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIEntitlementRefreshEventReceiverLibrary">();
	}
	static class UModioUIEntitlementRefreshEventReceiverLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioUIEntitlementRefreshEventReceiverLibrary>();
	}
};
static_assert(alignof(UModioUIEntitlementRefreshEventReceiverLibrary) == 0x000008, "Wrong alignment on UModioUIEntitlementRefreshEventReceiverLibrary");
static_assert(sizeof(UModioUIEntitlementRefreshEventReceiverLibrary) == 0x000028, "Wrong size on UModioUIEntitlementRefreshEventReceiverLibrary");

// Class ModioUICore.ModioUIHasConfigurableColor
// 0x0000 (0x0000 - 0x0000)
class IModioUIHasConfigurableColor final
{
public:
	void ConfigureWidgetColor(class FName ColorName, const struct FLinearColorRef& ColorValue);
	void ConfigureWidgetColorDirectly(class FName ColorName, const struct FSlateColor& ColorValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIHasConfigurableColor">();
	}
	static class IModioUIHasConfigurableColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIHasConfigurableColor>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIHasConfigurableColor) == 0x000001, "Wrong alignment on IModioUIHasConfigurableColor");
static_assert(sizeof(IModioUIHasConfigurableColor) == 0x000001, "Wrong size on IModioUIHasConfigurableColor");

// Class ModioUICore.ModioUIHasLoadStateWidget
// 0x0000 (0x0000 - 0x0000)
class IModioUIHasLoadStateWidget final
{
public:
	void AddLoadStateChangedHandler(const TDelegate<void(class UObject* Object, EModioUILoadState NewState)>& Handler);
	void RemoveLoadStateChangedHandler(const TDelegate<void(class UObject* Object, EModioUILoadState NewState)>& Handler);
	void SetLoadState(EModioUILoadState NewState);

	EModioUILoadState GetLoadState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIHasLoadStateWidget">();
	}
	static class IModioUIHasLoadStateWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIHasLoadStateWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIHasLoadStateWidget) == 0x000001, "Wrong alignment on IModioUIHasLoadStateWidget");
static_assert(sizeof(IModioUIHasLoadStateWidget) == 0x000001, "Wrong size on IModioUIHasLoadStateWidget");

// Class ModioUICore.ModioUIHasTextWidget
// 0x0000 (0x0000 - 0x0000)
class IModioUIHasTextWidget final
{
public:
	class FText GetWidgetText();
	struct FSlateFontInfo GetWidgetTextFont();
	void SetWidgetText(const class FText& DisplayText);
	void SetWidgetTextFont(const struct FSlateFontInfo& FontInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIHasTextWidget">();
	}
	static class IModioUIHasTextWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIHasTextWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIHasTextWidget) == 0x000001, "Wrong alignment on IModioUIHasTextWidget");
static_assert(sizeof(IModioUIHasTextWidget) == 0x000001, "Wrong size on IModioUIHasTextWidget");

// Class ModioUICore.ModioUIHasTooltipWidget
// 0x0000 (0x0000 - 0x0000)
class IModioUIHasTooltipWidget final
{
public:
	void ConfigureTooltip(const class FText& TitleText, const class FText& InfoText, const class FText& TagText);
	void SetTooltipEnabledState(bool bNewEnabledState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIHasTooltipWidget">();
	}
	static class IModioUIHasTooltipWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIHasTooltipWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIHasTooltipWidget) == 0x000001, "Wrong alignment on IModioUIHasTooltipWidget");
static_assert(sizeof(IModioUIHasTooltipWidget) == 0x000001, "Wrong size on IModioUIHasTooltipWidget");

// Class ModioUICore.ModioUIHoverableWidget
// 0x0000 (0x0000 - 0x0000)
class IModioUIHoverableWidget final
{
public:
	void AddHoverStateChangedHandler(const TDelegate<void(class UObject* HoverContext, bool bHoveredState)>& Handler);
	void DisableHoverEvents();
	void EnableHoverEvents();
	void RemoveHoverStateChangedHandler(const TDelegate<void(class UObject* HoverContext, bool bHoveredState)>& Handler);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIHoverableWidget">();
	}
	static class IModioUIHoverableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIHoverableWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIHoverableWidget) == 0x000001, "Wrong alignment on IModioUIHoverableWidget");
static_assert(sizeof(IModioUIHoverableWidget) == 0x000001, "Wrong size on IModioUIHoverableWidget");

// Class ModioUICore.ModioUIImageDisplayWidget
// 0x0000 (0x0000 - 0x0000)
class IModioUIImageDisplayWidget final
{
public:
	void AddImageLoadEventHandler(const TDelegate<void(class UObject* LoadContext, bool bLoadSuccess)>& Handler);
	void BeginLoadImageFromFile(const struct FModioImageWrapper& Image);
	void RemoveImageLoadEventHandler(const TDelegate<void(class UObject* LoadContext, bool bLoadSuccess)>& Handler);
	void SetBrushDirectly(const struct FSlateBrush& NewBrush);
	void SetBrushMatchTextureSize(bool bMatchTextureSize);
	void SetDesiredBrushSize(const struct FVector2D& DesiredSize);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIImageDisplayWidget">();
	}
	static class IModioUIImageDisplayWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIImageDisplayWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIImageDisplayWidget) == 0x000001, "Wrong alignment on IModioUIImageDisplayWidget");
static_assert(sizeof(IModioUIImageDisplayWidget) == 0x000001, "Wrong size on IModioUIImageDisplayWidget");

// Class ModioUICore.ModioUIViewModCommand
// 0x0010 (0x0038 - 0x0028)
class UModioUIViewModCommand final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                DataSource;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIViewModCommand">();
	}
	static class UModioUIViewModCommand* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioUIViewModCommand>();
	}
};
static_assert(alignof(UModioUIViewModCommand) == 0x000008, "Wrong alignment on UModioUIViewModCommand");
static_assert(sizeof(UModioUIViewModCommand) == 0x000038, "Wrong size on UModioUIViewModCommand");
static_assert(offsetof(UModioUIViewModCommand, DataSource) == 0x000030, "Member 'UModioUIViewModCommand::DataSource' has a wrong offset!");

// Class ModioUICore.ModioUIMediaDownloadCompletedReceiver
// 0x0000 (0x0000 - 0x0000)
class IModioUIMediaDownloadCompletedReceiver final
{
public:
	void OnModCreatorAvatarDownloadCompleted(const struct FModioModID& ModId, const struct FModioErrorCode& ErrorCode, const struct FModioOptionalImage& Image);
	void OnModGalleryImageDownloadCompleted(const struct FModioModID& ModId, const struct FModioErrorCode& ErrorCode, int32 ImageIndex, const struct FModioOptionalImage& Image);
	void OnModLogoDownloadCompleted(const struct FModioModID& ModId, const struct FModioErrorCode& ErrorCode, const struct FModioOptionalImage& Image, EModioLogoSize LogoSize);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIMediaDownloadCompletedReceiver">();
	}
	static class IModioUIMediaDownloadCompletedReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIMediaDownloadCompletedReceiver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIMediaDownloadCompletedReceiver) == 0x000001, "Wrong alignment on IModioUIMediaDownloadCompletedReceiver");
static_assert(sizeof(IModioUIMediaDownloadCompletedReceiver) == 0x000001, "Wrong size on IModioUIMediaDownloadCompletedReceiver");

// Class ModioUICore.ModioUIMediaDownloadCompletedReceiverLibrary
// 0x0000 (0x0028 - 0x0028)
class UModioUIMediaDownloadCompletedReceiverLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DeregisterMediaDownloadCompletedReceiver(class UObject* ObjectToDeregister, EModioUIMediaDownloadEventType DownloadTypes);
	static void RegisterMediaDownloadCompletedReceiver(class UObject* ObjectToRegister, EModioUIMediaDownloadEventType DownloadTypes);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIMediaDownloadCompletedReceiverLibrary">();
	}
	static class UModioUIMediaDownloadCompletedReceiverLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioUIMediaDownloadCompletedReceiverLibrary>();
	}
};
static_assert(alignof(UModioUIMediaDownloadCompletedReceiverLibrary) == 0x000008, "Wrong alignment on UModioUIMediaDownloadCompletedReceiverLibrary");
static_assert(sizeof(UModioUIMediaDownloadCompletedReceiverLibrary) == 0x000028, "Wrong size on UModioUIMediaDownloadCompletedReceiverLibrary");

// Class ModioUICore.ModioUIModEnabledStateChangedReceiver
// 0x0000 (0x0000 - 0x0000)
class IModioUIModEnabledStateChangedReceiver final
{
public:
	void OnModEnabledStateChanged(const struct FModioModID& ModId, bool bNewEnabledState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIModEnabledStateChangedReceiver">();
	}
	static class IModioUIModEnabledStateChangedReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIModEnabledStateChangedReceiver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIModEnabledStateChangedReceiver) == 0x000001, "Wrong alignment on IModioUIModEnabledStateChangedReceiver");
static_assert(sizeof(IModioUIModEnabledStateChangedReceiver) == 0x000001, "Wrong size on IModioUIModEnabledStateChangedReceiver");

// Class ModioUICore.ModioUIModEnabledStateChangedReceiverLibrary
// 0x0000 (0x0028 - 0x0028)
class UModioUIModEnabledStateChangedReceiverLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DeregisterModEnabledStateChangedReceiver(class UObject* ObjectToDeregister);
	static void RegisterModEnabledStateChangedReceiver(class UObject* ObjectToRegister);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIModEnabledStateChangedReceiverLibrary">();
	}
	static class UModioUIModEnabledStateChangedReceiverLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioUIModEnabledStateChangedReceiverLibrary>();
	}
};
static_assert(alignof(UModioUIModEnabledStateChangedReceiverLibrary) == 0x000008, "Wrong alignment on UModioUIModEnabledStateChangedReceiverLibrary");
static_assert(sizeof(UModioUIModEnabledStateChangedReceiverLibrary) == 0x000028, "Wrong size on UModioUIModEnabledStateChangedReceiverLibrary");

// Class ModioUICore.ModioUIModEnabledStateProvider
// 0x0000 (0x0000 - 0x0000)
class IModioUIModEnabledStateProvider final
{
public:
	void AddModEnabledStateChangeHandler(const TDelegate<void(int64 RawID, bool bNewEnabledState)>& Handler);
	bool QueryIsModEnabled(const struct FModioModID& ModId);
	void RemoveModEnabledStateChangeHandler(const TDelegate<void(int64 RawID, bool bNewEnabledState)>& Handler);
	bool RequestModEnabledStateChange(const struct FModioModID& ID, bool bNewEnabledState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIModEnabledStateProvider">();
	}
	static class IModioUIModEnabledStateProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIModEnabledStateProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIModEnabledStateProvider) == 0x000001, "Wrong alignment on IModioUIModEnabledStateProvider");
static_assert(sizeof(IModioUIModEnabledStateProvider) == 0x000001, "Wrong size on IModioUIModEnabledStateProvider");

// Class ModioUICore.ModioUIModInfoReceiver
// 0x0000 (0x0000 - 0x0000)
class IModioUIModInfoReceiver final
{
public:
	void OnListAllModsRequestCompleted(const class FString& RequestIdentifier, const struct FModioErrorCode& ErrorCode, const struct FModioOptionalModInfoList& List);
	void OnModInfoRequestCompleted(const struct FModioModID& ModId, const struct FModioErrorCode& ErrorCode, const struct FModioOptionalModInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioUIModInfoReceiver">();
	}
	static class IModioUIModInfoReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IModioUIModInfoReceiver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IModioUIModInfoReceiver) == 0x000001, "Wrong alignment on IModioUIModInfoReceiver");
static_assert(sizeof(IModioUIModInfoReceiver) == 0x000001, "Wrong size on IModioUIModInfoReceiver");

// Class ModioUICore.ModioUISubsystem
// 0x02C0 (0x02F0 - 0x0030)
class UModioUISubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ModEnabledStateDataProvider;                       // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                ModRatingStateProvider;                            // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x260];                                     // 0x0090(0x0260)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisableModManagement();
	struct FModioErrorCode EnableModManagement();
	float GetCurrentDPIScaleValue();
	bool IsUGCFeatureEnabled(EModioUIFeatureFlags Feature);
	void NotifyConnectivityChange(bool bNewConnectivityState);
	void OnModEnabledChanged(int64 RawModID, bool bNewEnabledState);
	bool QueryConnectivityState();
	bool QueryIsModEnabled(const struct FModioModID& ID);
	void RequestEmailAuthenticationWithHandler(const struct FModioEmailAuthCode& Code, const TDelegate<void(const struct FModioErrorCode& ErrorCode)> Callback);
	void RequestGalleryImageDownloadForModID(const struct FModioModID& ID, int32 Index_0, EModioGallerySize ImageSize);
	void RequestListAllMods(const struct FModioFilterParams& Params_0, const class FString& RequestIdentifier);
	void RequestListAllTokenPacks();
	void RequestLogoDownloadForModID(const struct FModioModID& ID, EModioLogoSize LogoSize);
	bool RequestModEnabledStateChange(const struct FModioModID& ID, bool bNewEnabledState);
	void RequestModInfoForModIDs(const TArray<struct FModioModID>& IDs);
	void RequestPurchaseForModIDWithHandler(const struct FModioModID& ID, const struct FModioUnsigned64& ExpectedPrice, const TDelegate<void(const struct FModioErrorCode& ErrorCode, const struct FModioOptionalTransactionRecord& Transaction)>& Callback);
	bool RequestPurchaseTokenPack(const struct FModioTokenPackID& TokenPackID, const TDelegate<void(bool bSuccess, const class FString& Message)>& Callback);
	void RequestRefreshEntitlements();
	void RequestRemoveSubscriptionForModID(const struct FModioModID& ID);
	void RequestRemoveSubscriptionForModIDWithHandler(const struct FModioModID& ID, TDelegate<void(const struct FModioErrorCode& ErrorCode)> DedicatedCallback);
	void RequestShowDialog(EModioUIDialogType DialogType, class UObject* DataSource);
	EModioOpenStoreResult RequestShowTokenPurchaseUI();
	EModioOpenStoreResult RequestShowTokenPurchaseUIWithHandler(const TDelegate<void(bool bResult, const class FString& Message)>& Callback);
	void RequestSubscriptionForModID(const struct FModioModID& ID, bool IncludeDependencies);
	void RequestSubscriptionForModIDWithHandler(const struct FModioModID& ID, bool IncludeDependencies, TDelegate<void(const struct FModioErrorCode& ErrorCode)> Callback);
	void RequestUserAvatar();
	void RequestWalletBalanceRefresh();
	void RequestWalletBalanceRefreshWithHandler(const TDelegate<void(const struct FModioErrorCode& ErrorCode, const struct FModioOptionalUInt64& WalletBalance)>& Callback);
	void SetModEnabledStateDataProvider(TScriptInterface<class IModioUIModEnabledStateProvider> InModEnabledStateDataProvider);
	void SetModRatingStateDataProvider(TScriptInterface<class IModRatingStateProvider> InModRatingStateProvider);
	void SubscriptionHandler(const struct FModioErrorCode& ErrorCode, const struct FModioModID& ID);
	void UninstallHandler(const struct FModioErrorCode& ErrorCode, const struct FModioModID& ID);
