#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PreMission_PlanningMap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "ReadyOrNot_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.AddPreviewLinePoint
// 0x0150 (0x0150 - 0x0000)
struct W_PreMission_PlanningMap_C_AddPreviewLinePoint final
{
public:
	struct FVector2D                              Coordinates;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      LinePoints;                                        // 0x0010(0x0010)(Edit, BlueprintVisible)
	bool                                          FirstPoint;                                        // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                NodeWidget;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0030(0x0020)(NoDestructor)
	struct FAnchorData                            K2Node_MakeStruct_AnchorData;                      // 0x0050(0x0040)(NoDestructor)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotPlayerController*            CallFunc_GetReadyOrNotPlayerController_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotPlayerState*                 K2Node_DynamicCast_AsReady_or_Not_Player_State;    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x00B0(0x0020)(NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAnchorData                            K2Node_MakeStruct_AnchorData_1;                    // 0x00D8(0x0040)(NoDestructor)
	class AReadyOrNotPlayerController*            CallFunc_GetReadyOrNotPlayerController_ReturnValue_1; // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_OfficerMarker_C*                     CallFunc_Create_ReturnValue;                       // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_PreMission_Tablet_PlayerNode_C*      CallFunc_Create_ReturnValue_1;                     // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue_1;           // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_PreMission_PlanningMap_Line_C*       CallFunc_Create_ReturnValue_2;                     // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_PlanningMap_C_AddPreviewLinePoint) == 0x000008, "Wrong alignment on W_PreMission_PlanningMap_C_AddPreviewLinePoint");
static_assert(sizeof(W_PreMission_PlanningMap_C_AddPreviewLinePoint) == 0x000150, "Wrong size on W_PreMission_PlanningMap_C_AddPreviewLinePoint");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, Coordinates) == 0x000000, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::Coordinates' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, LinePoints) == 0x000010, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::LinePoints' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, FirstPoint) == 0x000020, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::FirstPoint' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, NodeWidget) == 0x000028, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::NodeWidget' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, K2Node_MakeStruct_Anchors) == 0x000030, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, K2Node_MakeStruct_AnchorData) == 0x000050, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::K2Node_MakeStruct_AnchorData' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, CallFunc_SelectFloat_ReturnValue) == 0x000090, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, CallFunc_GetReadyOrNotPlayerController_ReturnValue) == 0x000098, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::CallFunc_GetReadyOrNotPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, K2Node_DynamicCast_AsReady_or_Not_Player_State) == 0x0000A0, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::K2Node_DynamicCast_AsReady_or_Not_Player_State' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, CallFunc_Array_Add_ReturnValue) == 0x0000AC, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, K2Node_MakeStruct_Anchors_1) == 0x0000B0, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::K2Node_MakeStruct_Anchors_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, CallFunc_AddChildToCanvas_ReturnValue) == 0x0000D0, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, K2Node_MakeStruct_AnchorData_1) == 0x0000D8, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::K2Node_MakeStruct_AnchorData_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, CallFunc_GetReadyOrNotPlayerController_ReturnValue_1) == 0x000118, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::CallFunc_GetReadyOrNotPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, CallFunc_Array_Add_ReturnValue_1) == 0x000120, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, CallFunc_Create_ReturnValue) == 0x000128, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, CallFunc_Create_ReturnValue_1) == 0x000130, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, CallFunc_AddChildToCanvas_ReturnValue_1) == 0x000138, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::CallFunc_AddChildToCanvas_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, CallFunc_Create_ReturnValue_2) == 0x000140, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_AddPreviewLinePoint, CallFunc_Array_Add_ReturnValue_2) == 0x000148, "Member 'W_PreMission_PlanningMap_C_AddPreviewLinePoint::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.BackPage
// 0x0001 (0x0001 - 0x0000)
struct W_PreMission_PlanningMap_C_BackPage final
{
public:
	bool                                          Handled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_PlanningMap_C_BackPage) == 0x000001, "Wrong alignment on W_PreMission_PlanningMap_C_BackPage");
static_assert(sizeof(W_PreMission_PlanningMap_C_BackPage) == 0x000001, "Wrong size on W_PreMission_PlanningMap_C_BackPage");
static_assert(offsetof(W_PreMission_PlanningMap_C_BackPage, Handled) == 0x000000, "Member 'W_PreMission_PlanningMap_C_BackPage::Handled' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.BndEvt__W_PreMission_PlanningMap_btn_Legend_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Legend_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class UW_PremissionTablet_Button_C*           TriggeringButton;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Legend_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Legend_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Legend_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Legend_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Legend_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, TriggeringButton) == 0x000000, "Member 'W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Legend_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::TriggeringButton' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.BndEvt__W_PreMission_PlanningMap_btn_Players_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Players_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	class UW_PremissionTablet_Button_C*           TriggeringButton;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Players_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Players_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Players_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong size on W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Players_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Players_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, TriggeringButton) == 0x000000, "Member 'W_PreMission_PlanningMap_C_BndEvt__W_PreMission_PlanningMap_btn_Players_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::TriggeringButton' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.ChangeFloorByIndex
// 0x00E8 (0x00E8 - 0x0000)
struct W_PreMission_PlanningMap_C_ChangeFloorByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLevelFloorData                        FloorData;                                         // 0x0008(0x0080)(Edit, BlueprintVisible)
	TArray<int32>                                 CallFunc_Map_Keys_Keys;                            // 0x0088(0x0010)(ReferenceParm)
	TArray<int32>                                 CallFunc_Map_Keys_Keys_1;                          // 0x0098(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_PreMission_PlanningMap_Level_C*      CallFunc_Map_Find_Value;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetLazyLoadedImage_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_PlanningMap_C_ChangeFloorByIndex) == 0x000008, "Wrong alignment on W_PreMission_PlanningMap_C_ChangeFloorByIndex");
static_assert(sizeof(W_PreMission_PlanningMap_C_ChangeFloorByIndex) == 0x0000E8, "Wrong size on W_PreMission_PlanningMap_C_ChangeFloorByIndex");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, Index_0) == 0x000000, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::Index_0' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, FloorData) == 0x000008, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::FloorData' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, CallFunc_Map_Keys_Keys) == 0x000088, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, CallFunc_Map_Keys_Keys_1) == 0x000098, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000A8, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, CallFunc_Array_Get_Item) == 0x0000AC, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, CallFunc_Map_Find_Value) == 0x0000B0, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, CallFunc_Map_Find_ReturnValue) == 0x0000B8, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, CallFunc_IsValid_ReturnValue) == 0x0000B9, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, CallFunc_GetLazyLoadedImage_ReturnValue) == 0x0000C0, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::CallFunc_GetLazyLoadedImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x0000C8, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000D0, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByIndex, CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast) == 0x0000E0, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByIndex::CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.ChangeFloorByNumber
// 0x0098 (0x0098 - 0x0000)
struct W_PreMission_PlanningMap_C_ChangeFloorByNumber final
{
public:
	int32                                         FloorNumber;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLevelFloorData                        FloorData;                                         // 0x0008(0x0080)(Edit, BlueprintVisible)
	class UW_PreMission_PlanningMap_Level_C*      CallFunc_Map_Find_Value;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_PlanningMap_C_ChangeFloorByNumber) == 0x000008, "Wrong alignment on W_PreMission_PlanningMap_C_ChangeFloorByNumber");
static_assert(sizeof(W_PreMission_PlanningMap_C_ChangeFloorByNumber) == 0x000098, "Wrong size on W_PreMission_PlanningMap_C_ChangeFloorByNumber");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByNumber, FloorNumber) == 0x000000, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByNumber::FloorNumber' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByNumber, FloorData) == 0x000008, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByNumber::FloorData' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByNumber, CallFunc_Map_Find_Value) == 0x000088, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByNumber::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangeFloorByNumber, CallFunc_Map_Find_ReturnValue) == 0x000090, "Member 'W_PreMission_PlanningMap_C_ChangeFloorByNumber::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.ChangePage
// 0x0008 (0x0008 - 0x0000)
struct W_PreMission_PlanningMap_C_ChangePage final
{
public:
	class FName                                   PageName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_PlanningMap_C_ChangePage) == 0x000004, "Wrong alignment on W_PreMission_PlanningMap_C_ChangePage");
static_assert(sizeof(W_PreMission_PlanningMap_C_ChangePage) == 0x000008, "Wrong size on W_PreMission_PlanningMap_C_ChangePage");
static_assert(offsetof(W_PreMission_PlanningMap_C_ChangePage, PageName) == 0x000000, "Member 'W_PreMission_PlanningMap_C_ChangePage::PageName' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.Clamp Map Coorinates to Screen View
// 0x0070 (0x0070 - 0x0000)
struct W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View final
{
public:
	double                                        in_x;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        in_y;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        X;                                                 // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Y;                                                 // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetWidgetSize_Absolute_ReturnValue;       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View) == 0x000008, "Wrong alignment on W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View");
static_assert(sizeof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View) == 0x000070, "Wrong size on W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View");
static_assert(offsetof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View, in_x) == 0x000000, "Member 'W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View::in_x' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View, in_y) == 0x000008, "Member 'W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View::in_y' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View, X) == 0x000010, "Member 'W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View::X' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View, Y) == 0x000018, "Member 'W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View::Y' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View, CallFunc_GetWidgetSize_Absolute_ReturnValue) == 0x000020, "Member 'W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View::CallFunc_GetWidgetSize_Absolute_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000030, "Member 'W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View, CallFunc_BreakVector2D_X) == 0x000040, "Member 'W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View, CallFunc_BreakVector2D_Y) == 0x000048, "Member 'W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View, CallFunc_FClamp_ReturnValue) == 0x000060, "Member 'W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View, CallFunc_FClamp_ReturnValue_1) == 0x000068, "Member 'W_PreMission_PlanningMap_C_Clamp_Map_Coorinates_to_Screen_View::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.CloseRadial
// 0x0001 (0x0001 - 0x0000)
struct W_PreMission_PlanningMap_C_CloseRadial final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_PlanningMap_C_CloseRadial) == 0x000001, "Wrong alignment on W_PreMission_PlanningMap_C_CloseRadial");
static_assert(sizeof(W_PreMission_PlanningMap_C_CloseRadial) == 0x000001, "Wrong size on W_PreMission_PlanningMap_C_CloseRadial");
static_assert(offsetof(W_PreMission_PlanningMap_C_CloseRadial, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'W_PreMission_PlanningMap_C_CloseRadial::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.CreateEntryPoints
// 0x08C8 (0x08C8 - 0x0000)
struct W_PreMission_PlanningMap_C_CreateEntryPoints final
{
public:
	struct FLevelDataLookupTable                  LevelDataLookupTable;                              // 0x0000(0x0880)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TDelegate<void(class UW_PreMission_Tablet_EntryPoint_C* Clicked)> OnEntryPointSelected;          // 0x0880(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class FName                                   PointTag;                                          // 0x0890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   PointName;                                         // 0x0898(0x0018)(Edit, BlueprintVisible)
	TArray<struct FEntryPoint>                    EntryPoints;                                       // 0x08B0(0x0010)(Edit, BlueprintVisible)
	class UW_PreMission_Tablet_EntryPoint_C*      NewEntryPoint;                                     // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_PlanningMap_C_CreateEntryPoints) == 0x000008, "Wrong alignment on W_PreMission_PlanningMap_C_CreateEntryPoints");
static_assert(sizeof(W_PreMission_PlanningMap_C_CreateEntryPoints) == 0x0008C8, "Wrong size on W_PreMission_PlanningMap_C_CreateEntryPoints");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateEntryPoints, LevelDataLookupTable) == 0x000000, "Member 'W_PreMission_PlanningMap_C_CreateEntryPoints::LevelDataLookupTable' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateEntryPoints, OnEntryPointSelected) == 0x000880, "Member 'W_PreMission_PlanningMap_C_CreateEntryPoints::OnEntryPointSelected' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateEntryPoints, PointTag) == 0x000890, "Member 'W_PreMission_PlanningMap_C_CreateEntryPoints::PointTag' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateEntryPoints, PointName) == 0x000898, "Member 'W_PreMission_PlanningMap_C_CreateEntryPoints::PointName' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateEntryPoints, EntryPoints) == 0x0008B0, "Member 'W_PreMission_PlanningMap_C_CreateEntryPoints::EntryPoints' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateEntryPoints, NewEntryPoint) == 0x0008C0, "Member 'W_PreMission_PlanningMap_C_CreateEntryPoints::NewEntryPoint' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.CreateMapLevelCanvas
// 0x00C8 (0x00C8 - 0x0000)
struct W_PreMission_PlanningMap_C_CreateMapLevelCanvas final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLevelFloor                            LevelData;                                         // 0x0008(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UW_PreMission_PlanningMap_Level_C*      LevelCanvas;                                       // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_PreMission_Tablet_MapMarker_C* TriggeringMarker, int32 FloorLevel, double Rotation)> K2Node_CreateDelegate_OutputDelegate; // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_PreMission_PlanningMap_Level_C*      CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 LineID, class UCanvasPanel* LineCanvas)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 MarkerID, class UW_PreMission_Tablet_MapMarker_C* Marker)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcherSlot*                    K2Node_DynamicCast_AsWidget_Switcher_Slot;         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_PlanningMap_C_CreateMapLevelCanvas) == 0x000008, "Wrong alignment on W_PreMission_PlanningMap_C_CreateMapLevelCanvas");
static_assert(sizeof(W_PreMission_PlanningMap_C_CreateMapLevelCanvas) == 0x0000C8, "Wrong size on W_PreMission_PlanningMap_C_CreateMapLevelCanvas");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateMapLevelCanvas, Index_0) == 0x000000, "Member 'W_PreMission_PlanningMap_C_CreateMapLevelCanvas::Index_0' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateMapLevelCanvas, LevelData) == 0x000008, "Member 'W_PreMission_PlanningMap_C_CreateMapLevelCanvas::LevelData' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateMapLevelCanvas, LevelCanvas) == 0x000070, "Member 'W_PreMission_PlanningMap_C_CreateMapLevelCanvas::LevelCanvas' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateMapLevelCanvas, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'W_PreMission_PlanningMap_C_CreateMapLevelCanvas::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateMapLevelCanvas, CallFunc_Create_ReturnValue) == 0x000088, "Member 'W_PreMission_PlanningMap_C_CreateMapLevelCanvas::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateMapLevelCanvas, K2Node_CreateDelegate_OutputDelegate_1) == 0x000090, "Member 'W_PreMission_PlanningMap_C_CreateMapLevelCanvas::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateMapLevelCanvas, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A0, "Member 'W_PreMission_PlanningMap_C_CreateMapLevelCanvas::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateMapLevelCanvas, CallFunc_AddChild_ReturnValue) == 0x0000B0, "Member 'W_PreMission_PlanningMap_C_CreateMapLevelCanvas::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateMapLevelCanvas, K2Node_DynamicCast_AsWidget_Switcher_Slot) == 0x0000B8, "Member 'W_PreMission_PlanningMap_C_CreateMapLevelCanvas::K2Node_DynamicCast_AsWidget_Switcher_Slot' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_CreateMapLevelCanvas, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'W_PreMission_PlanningMap_C_CreateMapLevelCanvas::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.DrawLine
// 0x0298 (0x0298 - 0x0000)
struct W_PreMission_PlanningMap_C_DrawLine final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlanningLine                          LineData;                                          // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AReadyOrNotPlayerState*                 NewLocalVar;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotPlayerState*                 LineOwner;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas;                                            // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_PreMission_PlanningMap_Line_C*       Line;                                              // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          LastNode;                                          // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EndOffset;                                         // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartOffset;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PreviousPoint;                                     // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Coordinates;                                       // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                NodeWidget;                                        // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstNode;                                         // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PreMission_PlanningMap_Line_C*       CallFunc_Create_ReturnValue;                       // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotPlayerState*                 CallFunc_GetPlayerStateFromPlanningNumber_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BP_GetUniqueIdString_ReturnValue;         // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerBanned_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_OfficerMarker_C*                     CallFunc_Create_ReturnValue_1;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_PreMission_Tablet_PlayerNode_C*      CallFunc_Create_ReturnValue_2;                     // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Array_Get_Item;                           // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UW_OfficerMarker_C* TriggeringMarker)> K2Node_CreateDelegate_OutputDelegate; // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetPlayerTeamColor_LinearColor;           // 0x0104(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetPlayerTeamColor_SlateColor;            // 0x0114(0x0014)()
	TDelegate<void(class UW_OfficerMarker_C* TriggeringMarker)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0140(0x0020)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchorData                            K2Node_MakeStruct_AnchorData;                      // 0x0168(0x0040)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetLineAngle_Angle;                       // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetLineLength_Length;                     // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x01C0(0x0020)(NoDestructor)
	struct FAnchorData                            K2Node_MakeStruct_AnchorData_1;                    // 0x01E0(0x0040)(NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue_1;           // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CallFunc_SpawnObject_ReturnValue;                  // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors_2;                       // 0x0230(0x0020)(NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue_2;           // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAnchorData                            K2Node_MakeStruct_AnchorData_2;                    // 0x0258(0x0040)(NoDestructor)
};
static_assert(alignof(W_PreMission_PlanningMap_C_DrawLine) == 0x000008, "Wrong alignment on W_PreMission_PlanningMap_C_DrawLine");
static_assert(sizeof(W_PreMission_PlanningMap_C_DrawLine) == 0x000298, "Wrong size on W_PreMission_PlanningMap_C_DrawLine");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, ID) == 0x000000, "Member 'W_PreMission_PlanningMap_C_DrawLine::ID' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, LineData) == 0x000008, "Member 'W_PreMission_PlanningMap_C_DrawLine::LineData' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, NewLocalVar) == 0x000030, "Member 'W_PreMission_PlanningMap_C_DrawLine::NewLocalVar' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, LineOwner) == 0x000038, "Member 'W_PreMission_PlanningMap_C_DrawLine::LineOwner' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, Canvas) == 0x000040, "Member 'W_PreMission_PlanningMap_C_DrawLine::Canvas' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, Line) == 0x000048, "Member 'W_PreMission_PlanningMap_C_DrawLine::Line' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, LastNode) == 0x000050, "Member 'W_PreMission_PlanningMap_C_DrawLine::LastNode' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, EndOffset) == 0x000058, "Member 'W_PreMission_PlanningMap_C_DrawLine::EndOffset' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, StartOffset) == 0x000060, "Member 'W_PreMission_PlanningMap_C_DrawLine::StartOffset' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, PreviousPoint) == 0x000068, "Member 'W_PreMission_PlanningMap_C_DrawLine::PreviousPoint' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, Coordinates) == 0x000078, "Member 'W_PreMission_PlanningMap_C_DrawLine::Coordinates' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, NodeWidget) == 0x000088, "Member 'W_PreMission_PlanningMap_C_DrawLine::NodeWidget' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, FirstNode) == 0x000090, "Member 'W_PreMission_PlanningMap_C_DrawLine::FirstNode' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_Create_ReturnValue) == 0x000098, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_Array_LastIndex_ReturnValue) == 0x0000A4, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_GetPlayerStateFromPlanningNumber_ReturnValue) == 0x0000A8, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_GetPlayerStateFromPlanningNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_BP_GetUniqueIdString_ReturnValue) == 0x0000B0, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_BP_GetUniqueIdString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_IsPlayerBanned_ReturnValue) == 0x0000C0, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_IsPlayerBanned_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_Create_ReturnValue_1) == 0x0000C8, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_Create_ReturnValue_2) == 0x0000D0, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, Temp_int_Array_Index_Variable) == 0x0000D8, "Member 'W_PreMission_PlanningMap_C_DrawLine::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000F1, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, K2Node_CreateDelegate_OutputDelegate) == 0x0000F4, "Member 'W_PreMission_PlanningMap_C_DrawLine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_GetPlayerTeamColor_LinearColor) == 0x000104, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_GetPlayerTeamColor_LinearColor' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_GetPlayerTeamColor_SlateColor) == 0x000114, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_GetPlayerTeamColor_SlateColor' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, K2Node_CreateDelegate_OutputDelegate_1) == 0x000128, "Member 'W_PreMission_PlanningMap_C_DrawLine::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_AddChildToCanvas_ReturnValue) == 0x000138, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, K2Node_MakeStruct_Anchors) == 0x000140, "Member 'W_PreMission_PlanningMap_C_DrawLine::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, Temp_int_Loop_Counter_Variable) == 0x000160, "Member 'W_PreMission_PlanningMap_C_DrawLine::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, K2Node_MakeStruct_AnchorData) == 0x000168, "Member 'W_PreMission_PlanningMap_C_DrawLine::K2Node_MakeStruct_AnchorData' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_Less_IntInt_ReturnValue) == 0x0001A8, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_Add_IntInt_ReturnValue) == 0x0001AC, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_GetLineAngle_Angle) == 0x0001B0, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_GetLineAngle_Angle' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_GetLineLength_Length) == 0x0001B8, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_GetLineLength_Length' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, K2Node_MakeStruct_Anchors_1) == 0x0001C0, "Member 'W_PreMission_PlanningMap_C_DrawLine::K2Node_MakeStruct_Anchors_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, K2Node_MakeStruct_AnchorData_1) == 0x0001E0, "Member 'W_PreMission_PlanningMap_C_DrawLine::K2Node_MakeStruct_AnchorData_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_AddChildToCanvas_ReturnValue_1) == 0x000220, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_AddChildToCanvas_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_SpawnObject_ReturnValue) == 0x000228, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, K2Node_MakeStruct_Anchors_2) == 0x000230, "Member 'W_PreMission_PlanningMap_C_DrawLine::K2Node_MakeStruct_Anchors_2' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, CallFunc_AddChildToCanvas_ReturnValue_2) == 0x000250, "Member 'W_PreMission_PlanningMap_C_DrawLine::CallFunc_AddChildToCanvas_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawLine, K2Node_MakeStruct_AnchorData_2) == 0x000258, "Member 'W_PreMission_PlanningMap_C_DrawLine::K2Node_MakeStruct_AnchorData_2' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.DrawMarker
// 0x0040 (0x0040 - 0x0000)
struct W_PreMission_PlanningMap_C_DrawMarker final
{
public:
	int32                                         MarkerID;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlanningMarker                        MarkerData;                                        // 0x0008(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class UW_PreMission_Tablet_MapMarker_C*       Marker;                                            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_PlanningMap_C_DrawMarker) == 0x000008, "Wrong alignment on W_PreMission_PlanningMap_C_DrawMarker");
static_assert(sizeof(W_PreMission_PlanningMap_C_DrawMarker) == 0x000040, "Wrong size on W_PreMission_PlanningMap_C_DrawMarker");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawMarker, MarkerID) == 0x000000, "Member 'W_PreMission_PlanningMap_C_DrawMarker::MarkerID' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawMarker, MarkerData) == 0x000008, "Member 'W_PreMission_PlanningMap_C_DrawMarker::MarkerData' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_DrawMarker, Marker) == 0x000038, "Member 'W_PreMission_PlanningMap_C_DrawMarker::Marker' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.EndMarkerRotation
// 0x0010 (0x0010 - 0x0000)
struct W_PreMission_PlanningMap_C_EndMarkerRotation final
{
public:
	class UW_PreMission_Tablet_MapMarker_C*       TriggeringMarker;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_PlanningMap_C_EndMarkerRotation) == 0x000008, "Wrong alignment on W_PreMission_PlanningMap_C_EndMarkerRotation");
static_assert(sizeof(W_PreMission_PlanningMap_C_EndMarkerRotation) == 0x000010, "Wrong size on W_PreMission_PlanningMap_C_EndMarkerRotation");
static_assert(offsetof(W_PreMission_PlanningMap_C_EndMarkerRotation, TriggeringMarker) == 0x000000, "Member 'W_PreMission_PlanningMap_C_EndMarkerRotation::TriggeringMarker' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_EndMarkerRotation, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'W_PreMission_PlanningMap_C_EndMarkerRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_PlanningMap_C_EndMarkerRotation, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'W_PreMission_PlanningMap_C_EndMarkerRotation::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function W_PreMission_PlanningMap.W_PreMission_PlanningMap_C.EraseLine
// 0x0018 (0x0018 - 0x0000)
struct W_PreMission_PlanningMap_C_EraseLine final
{
public:
