#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PreMission_Tablet

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "Slate_structs.hpp"
#include "ReadyOrNot_structs.hpp"


namespace SDK::Params
{

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.AudioPlayerVisible
// 0x0010 (0x0010 - 0x0000)
struct W_PreMission_Tablet_C_AudioPlayerVisible final
{
public:
	class UW_AudioPlayer_C*                       PlayerWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerVisible;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_AudioPlayerVisible) == 0x000008, "Wrong alignment on W_PreMission_Tablet_C_AudioPlayerVisible");
static_assert(sizeof(W_PreMission_Tablet_C_AudioPlayerVisible) == 0x000010, "Wrong size on W_PreMission_Tablet_C_AudioPlayerVisible");
static_assert(offsetof(W_PreMission_Tablet_C_AudioPlayerVisible, PlayerWidget) == 0x000000, "Member 'W_PreMission_Tablet_C_AudioPlayerVisible::PlayerWidget' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_AudioPlayerVisible, PlayerVisible) == 0x000008, "Member 'W_PreMission_Tablet_C_AudioPlayerVisible::PlayerVisible' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.BackPage
// 0x0001 (0x0001 - 0x0000)
struct W_PreMission_Tablet_C_BackPage final
{
public:
	bool                                          Handled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_BackPage) == 0x000001, "Wrong alignment on W_PreMission_Tablet_C_BackPage");
static_assert(sizeof(W_PreMission_Tablet_C_BackPage) == 0x000001, "Wrong size on W_PreMission_Tablet_C_BackPage");
static_assert(offsetof(W_PreMission_Tablet_C_BackPage, Handled) == 0x000000, "Member 'W_PreMission_Tablet_C_BackPage::Handled' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.BindHelictoperEvents
// 0x0028 (0x0028 - 0x0000)
struct W_PreMission_Tablet_C_BindHelictoperEvents final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHelicopter*                            CallFunc_GetActorOfClass_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTrackingCameraComponent*               CallFunc_GetTrackingCameraComponent_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_BindHelictoperEvents) == 0x000008, "Wrong alignment on W_PreMission_Tablet_C_BindHelictoperEvents");
static_assert(sizeof(W_PreMission_Tablet_C_BindHelictoperEvents) == 0x000028, "Wrong size on W_PreMission_Tablet_C_BindHelictoperEvents");
static_assert(offsetof(W_PreMission_Tablet_C_BindHelictoperEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'W_PreMission_Tablet_C_BindHelictoperEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_BindHelictoperEvents, CallFunc_GetActorOfClass_ReturnValue) == 0x000010, "Member 'W_PreMission_Tablet_C_BindHelictoperEvents::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_BindHelictoperEvents, CallFunc_GetTrackingCameraComponent_ReturnValue) == 0x000018, "Member 'W_PreMission_Tablet_C_BindHelictoperEvents::CallFunc_GetTrackingCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_BindHelictoperEvents, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'W_PreMission_Tablet_C_BindHelictoperEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_BindHelictoperEvents, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'W_PreMission_Tablet_C_BindHelictoperEvents::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.BndEvt__W_PreMission_Tablet_btn_Brief_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Brief_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature final
{
public:
	class UW_PremissionTablet_Button_C*           TriggeringButton;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Brief_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Brief_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature");
static_assert(sizeof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Brief_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature) == 0x000008, "Wrong size on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Brief_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature");
static_assert(offsetof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Brief_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature, TriggeringButton) == 0x000000, "Member 'W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Brief_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature::TriggeringButton' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.BndEvt__W_PreMission_Tablet_btn_Camera_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Camera_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature final
{
public:
	class UW_PremissionTablet_Button_C*           TriggeringButton;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Camera_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Camera_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature");
static_assert(sizeof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Camera_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature) == 0x000008, "Wrong size on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Camera_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature");
static_assert(offsetof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Camera_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature, TriggeringButton) == 0x000000, "Member 'W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Camera_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature::TriggeringButton' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.BndEvt__W_PreMission_Tablet_btn_Helicopter_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Helicopter_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature final
{
public:
	class UW_PremissionTablet_Button_C*           TriggeringButton;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Helicopter_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Helicopter_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature");
static_assert(sizeof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Helicopter_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature) == 0x000008, "Wrong size on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Helicopter_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature");
static_assert(offsetof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Helicopter_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature, TriggeringButton) == 0x000000, "Member 'W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Helicopter_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature::TriggeringButton' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.BndEvt__W_PreMission_Tablet_btn_Map_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Map_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature final
{
public:
	class UW_PremissionTablet_Button_C*           TriggeringButton;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Map_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Map_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(sizeof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Map_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x000008, "Wrong size on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Map_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(offsetof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Map_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature, TriggeringButton) == 0x000000, "Member 'W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Map_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature::TriggeringButton' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.BndEvt__W_PreMission_Tablet_btn_Team_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Team_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature final
{
public:
	class UW_PremissionTablet_Button_C*           TriggeringButton;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Team_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Team_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(sizeof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Team_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong size on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Team_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(offsetof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Team_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature, TriggeringButton) == 0x000000, "Member 'W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_btn_Team_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature::TriggeringButton' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.BndEvt__W_PreMission_Tablet_ExitTabletButton_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_ExitTabletButton_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature final
{
public:
	class UW_Button_C*                            Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_ExitTabletButton_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature) == 0x000008, "Wrong alignment on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_ExitTabletButton_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature");
static_assert(sizeof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_ExitTabletButton_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature) == 0x000008, "Wrong size on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_ExitTabletButton_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature");
static_assert(offsetof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_ExitTabletButton_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature, Button) == 0x000000, "Member 'W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_ExitTabletButton_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature::Button' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.BndEvt__W_PreMission_Tablet_NextScreenButton_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_NextScreenButton_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature final
{
public:
	class UW_Button_C*                            Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_NextScreenButton_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature) == 0x000008, "Wrong alignment on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_NextScreenButton_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature");
static_assert(sizeof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_NextScreenButton_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature) == 0x000008, "Wrong size on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_NextScreenButton_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature");
static_assert(offsetof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_NextScreenButton_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature, Button) == 0x000000, "Member 'W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_NextScreenButton_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature::Button' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.BndEvt__W_PreMission_Tablet_PreviousScreen_K2Node_ComponentBoundEvent_7_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_PreviousScreen_K2Node_ComponentBoundEvent_7_Clicked__DelegateSignature final
{
public:
	class UW_Button_C*                            Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_PreviousScreen_K2Node_ComponentBoundEvent_7_Clicked__DelegateSignature) == 0x000008, "Wrong alignment on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_PreviousScreen_K2Node_ComponentBoundEvent_7_Clicked__DelegateSignature");
static_assert(sizeof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_PreviousScreen_K2Node_ComponentBoundEvent_7_Clicked__DelegateSignature) == 0x000008, "Wrong size on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_PreviousScreen_K2Node_ComponentBoundEvent_7_Clicked__DelegateSignature");
static_assert(offsetof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_PreviousScreen_K2Node_ComponentBoundEvent_7_Clicked__DelegateSignature, Button) == 0x000000, "Member 'W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_PreviousScreen_K2Node_ComponentBoundEvent_7_Clicked__DelegateSignature::Button' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.BndEvt__W_PreMission_Tablet_W_OpenChatButton_K2Node_ComponentBoundEvent_11_Clicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_OpenChatButton_K2Node_ComponentBoundEvent_11_Clicked__DelegateSignature final
{
public:
	class UW_Button_C*                            Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_OpenChatButton_K2Node_ComponentBoundEvent_11_Clicked__DelegateSignature) == 0x000008, "Wrong alignment on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_OpenChatButton_K2Node_ComponentBoundEvent_11_Clicked__DelegateSignature");
static_assert(sizeof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_OpenChatButton_K2Node_ComponentBoundEvent_11_Clicked__DelegateSignature) == 0x000008, "Wrong size on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_OpenChatButton_K2Node_ComponentBoundEvent_11_Clicked__DelegateSignature");
static_assert(offsetof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_OpenChatButton_K2Node_ComponentBoundEvent_11_Clicked__DelegateSignature, Button) == 0x000000, "Member 'W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_OpenChatButton_K2Node_ComponentBoundEvent_11_Clicked__DelegateSignature::Button' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.BndEvt__W_PreMission_Tablet_W_PreMission_PlanningMap_K2Node_ComponentBoundEvent_6_OnMapLevelChanged__DelegateSignature
// 0x0078 (0x0078 - 0x0000)
struct W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_PreMission_PlanningMap_K2Node_ComponentBoundEvent_6_OnMapLevelChanged__DelegateSignature final
{
public:
	class FString                                 MissionURL;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FLevelFloor                            FloorData;                                         // 0x0010(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_PreMission_PlanningMap_K2Node_ComponentBoundEvent_6_OnMapLevelChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_PreMission_PlanningMap_K2Node_ComponentBoundEvent_6_OnMapLevelChanged__DelegateSignature");
static_assert(sizeof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_PreMission_PlanningMap_K2Node_ComponentBoundEvent_6_OnMapLevelChanged__DelegateSignature) == 0x000078, "Wrong size on W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_PreMission_PlanningMap_K2Node_ComponentBoundEvent_6_OnMapLevelChanged__DelegateSignature");
static_assert(offsetof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_PreMission_PlanningMap_K2Node_ComponentBoundEvent_6_OnMapLevelChanged__DelegateSignature, MissionURL) == 0x000000, "Member 'W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_PreMission_PlanningMap_K2Node_ComponentBoundEvent_6_OnMapLevelChanged__DelegateSignature::MissionURL' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_PreMission_PlanningMap_K2Node_ComponentBoundEvent_6_OnMapLevelChanged__DelegateSignature, FloorData) == 0x000010, "Member 'W_PreMission_Tablet_C_BndEvt__W_PreMission_Tablet_W_PreMission_PlanningMap_K2Node_ComponentBoundEvent_6_OnMapLevelChanged__DelegateSignature::FloorData' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct W_PreMission_Tablet_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on W_PreMission_Tablet_C_BP_OnHandleBackAction");
static_assert(sizeof(W_PreMission_Tablet_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on W_PreMission_Tablet_C_BP_OnHandleBackAction");
static_assert(offsetof(W_PreMission_Tablet_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'W_PreMission_Tablet_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.ChangePage
// 0x0008 (0x0008 - 0x0000)
struct W_PreMission_Tablet_C_ChangePage final
{
public:
	class FName                                   PageName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_ChangePage) == 0x000004, "Wrong alignment on W_PreMission_Tablet_C_ChangePage");
static_assert(sizeof(W_PreMission_Tablet_C_ChangePage) == 0x000008, "Wrong size on W_PreMission_Tablet_C_ChangePage");
static_assert(offsetof(W_PreMission_Tablet_C_ChangePage, PageName) == 0x000000, "Member 'W_PreMission_Tablet_C_ChangePage::PageName' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.DisplayNoDataScreen
// 0x0009 (0x0009 - 0x0000)
struct W_PreMission_Tablet_C_DisplayNoDataScreen final
{
public:
	bool                                          NoData_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_DisplayNoDataScreen) == 0x000001, "Wrong alignment on W_PreMission_Tablet_C_DisplayNoDataScreen");
static_assert(sizeof(W_PreMission_Tablet_C_DisplayNoDataScreen) == 0x000009, "Wrong size on W_PreMission_Tablet_C_DisplayNoDataScreen");
static_assert(offsetof(W_PreMission_Tablet_C_DisplayNoDataScreen, NoData_0) == 0x000000, "Member 'W_PreMission_Tablet_C_DisplayNoDataScreen::NoData_0' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_DisplayNoDataScreen, Temp_byte_Variable) == 0x000001, "Member 'W_PreMission_Tablet_C_DisplayNoDataScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_DisplayNoDataScreen, Temp_byte_Variable_1) == 0x000002, "Member 'W_PreMission_Tablet_C_DisplayNoDataScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_DisplayNoDataScreen, Temp_bool_Variable) == 0x000003, "Member 'W_PreMission_Tablet_C_DisplayNoDataScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_DisplayNoDataScreen, Temp_byte_Variable_2) == 0x000004, "Member 'W_PreMission_Tablet_C_DisplayNoDataScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_DisplayNoDataScreen, Temp_byte_Variable_3) == 0x000005, "Member 'W_PreMission_Tablet_C_DisplayNoDataScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_DisplayNoDataScreen, K2Node_Select_Default) == 0x000006, "Member 'W_PreMission_Tablet_C_DisplayNoDataScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_DisplayNoDataScreen, Temp_bool_Variable_1) == 0x000007, "Member 'W_PreMission_Tablet_C_DisplayNoDataScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_DisplayNoDataScreen, K2Node_Select_Default_1) == 0x000008, "Member 'W_PreMission_Tablet_C_DisplayNoDataScreen::K2Node_Select_Default_1' has a wrong offset!");

// Function W_PreMission_Tablet.W_PreMission_Tablet_C.ExecuteUbergraph_W_PreMission_Tablet
// 0x1430 (0x1430 - 0x0000)
struct W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Premission_Tablet_Overlay_C*         K2Node_DynamicCast_AsW_Premission_Tablet_Overlay;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PremissionTablet_Button_C*           K2Node_ComponentBoundEvent_TriggeringButton_4;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_PremissionTablet_Button_C*           K2Node_ComponentBoundEvent_TriggeringButton_3;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_PremissionTablet_Button_C*           K2Node_ComponentBoundEvent_TriggeringButton_2;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PageName;                             // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsGamepad;                            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_MissionURL;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLevelFloor                            K2Node_ComponentBoundEvent_FloorData;              // 0x0060(0x0068)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PreMission_Tablet_Floors_C*          K2Node_DynamicCast_AsW_Pre_Mission_Tablet_Floors;  // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Delay_1;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Collapse;                             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_URL;                                  // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLevelDataLookupTable                  K2Node_Event_LevelData_1;                          // 0x0108(0x0880)(ConstParm)
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsWithInterface_FoundWidgets;  // 0x0988(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0998(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99C[0x4];                                      // 0x099C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Delay;                                // 0x09A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A9[0x7];                                      // 0x09A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_AudioPlayer_C*                       K2Node_Event_PlayerWidget;                         // 0x09B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_PlayerVisible;                        // 0x09B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_UseDarkTheme;                         // 0x09B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9BA[0x6];                                      // 0x09BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_MissionURL;                           // 0x09C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLevelDataLookupTable                  K2Node_Event_LevelData;                            // 0x09D0(0x0880)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x1250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1254[0x4];                                     // 0x1254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x1258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x1260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MissionPlanning_C> K2Node_DynamicCast_AsBPI_Mission_Planning;        // 0x1268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x1278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1279[0x7];                                     // 0x1279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x1280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x1288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x1290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x1291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1292[0x6];                                     // 0x1292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PremissionTablet_Button_C*           K2Node_ComponentBoundEvent_TriggeringButton_1;     // 0x1298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x12A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x12A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A9[0x3];                                     // 0x12A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x12AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x12BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12BD[0x3];                                     // 0x12BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x12C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsAwake;                              // 0x12C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C5[0x3];                                     // 0x12C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x12C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x12D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12DC[0x4];                                     // 0x12DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x12E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ITabletUI_C>           K2Node_DynamicCast_AsTablet_UI;                    // 0x12E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x12F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x12F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12FA[0x2];                                     // 0x12FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x12FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x1300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultiplayer_ReturnValue;                // 0x1304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x1305(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1306[0x2];                                     // 0x1306(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Button_C*                            K2Node_ComponentBoundEvent_Button_3;               // 0x1308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Button_C*                            K2Node_ComponentBoundEvent_Button_2;               // 0x1310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotPlayerController*            CallFunc_GetReadyOrNotPlayerController_ReturnValue; // 0x1318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x1320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1321[0x7];                                     // 0x1321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x1328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x1330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x1338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1339[0x7];                                     // 0x1339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AReadyOrNotPlayerController*            CallFunc_GetReadyOrNotPlayerController_ReturnValue_1; // 0x1340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x1348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character_1;           // 0x1350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x1358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1359[0x3];                                     // 0x1359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x135C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x1360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x1361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1362[0x2];                                     // 0x1362(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x1364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x1368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1369[0x3];                                     // 0x1369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x136C(0x0008)(NoDestructor)
	uint8                                         Pad_1374[0x4];                                     // 0x1374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Button_C*                            K2Node_ComponentBoundEvent_Button_1;               // 0x1378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AReadyOrNotPlayerController*            CallFunc_GetReadyOrNotPlayerController_ReturnValue_2; // 0x1380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x1388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x1389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x138A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_138B[0x5];                                     // 0x138B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsWithInterface_FoundWidgets_1; // 0x1390(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x13A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A4[0x4];                                     // 0x13A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_PremissionTablet_Button_C*>   CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x13A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x13B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x13C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13CC[0x4];                                     // 0x13CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x13D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UW_PremissionTablet_Button_C*           K2Node_ComponentBoundEvent_TriggeringButton;       // 0x13E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHelicopterAvailable_ReturnValue;        // 0x13E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x13E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13EA[0x6];                                     // 0x13EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Premission_Tablet_Overlay_C*         K2Node_DynamicCast_AsW_Premission_Tablet_Overlay_1; // 0x13F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x13F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13F9[0x7];                                     // 0x13F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Button_C*                            K2Node_ComponentBoundEvent_Button;                 // 0x1400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMultiplayer_ReturnValue_1;              // 0x1408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x1409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x140A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x140B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue_1;                  // 0x140C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x140D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x140E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_140F[0x1];                                     // 0x140F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Premission_Tablet_Overlay_C*         K2Node_DynamicCast_AsW_Premission_Tablet_Overlay_2; // 0x1410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x1418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1419[0x7];                                     // 0x1419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Premission_Tablet_Overlay_C*         K2Node_DynamicCast_AsW_Premission_Tablet_Overlay_3; // 0x1420(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x1428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue_1;                // 0x1429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue_2;                // 0x142A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet) == 0x000008, "Wrong alignment on W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet");
static_assert(sizeof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet) == 0x001430, "Wrong size on W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, EntryPoint) == 0x000000, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_DynamicCast_AsW_Premission_Tablet_Overlay) == 0x000008, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_DynamicCast_AsW_Premission_Tablet_Overlay' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_ComponentBoundEvent_TriggeringButton_4) == 0x000018, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_ComponentBoundEvent_TriggeringButton_4' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000020, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_ComponentBoundEvent_TriggeringButton_3) == 0x000028, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_ComponentBoundEvent_TriggeringButton_3' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_ComponentBoundEvent_TriggeringButton_2) == 0x000030, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_ComponentBoundEvent_TriggeringButton_2' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_Event_IsDesignTime) == 0x000038, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_Event_PageName) == 0x00003C, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_Event_PageName' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_Event_IsGamepad) == 0x000044, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_Event_IsGamepad' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_ComponentBoundEvent_MissionURL) == 0x000050, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_ComponentBoundEvent_MissionURL' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_ComponentBoundEvent_FloorData) == 0x000060, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_ComponentBoundEvent_FloorData' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x0000C8, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, Temp_byte_Variable) == 0x0000D0, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_DynamicCast_AsW_Pre_Mission_Tablet_Floors) == 0x0000D8, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_DynamicCast_AsW_Pre_Mission_Tablet_Floors' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, Temp_byte_Variable_1) == 0x0000E1, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_Event_Delay_1) == 0x0000E8, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_Event_Delay_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_Event_Collapse) == 0x0000F0, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_Event_Collapse' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_Event_URL) == 0x0000F8, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_Event_URL' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_Event_LevelData_1) == 0x000108, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_Event_LevelData_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, CallFunc_GetAllWidgetsWithInterface_FoundWidgets) == 0x000988, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::CallFunc_GetAllWidgetsWithInterface_FoundWidgets' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, CallFunc_Array_Length_ReturnValue) == 0x000998, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_Event_Delay) == 0x0009A0, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_Event_Delay' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, Temp_bool_Variable) == 0x0009A8, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_Event_PlayerWidget) == 0x0009B0, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_Event_PlayerWidget' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_Event_PlayerVisible) == 0x0009B8, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_Event_PlayerVisible' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_Event_UseDarkTheme) == 0x0009B9, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_Event_UseDarkTheme' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_Event_MissionURL) == 0x0009C0, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_Event_MissionURL' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_Event_LevelData) == 0x0009D0, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_Event_LevelData' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, Temp_int_Array_Index_Variable) == 0x001250, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x001258, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, CallFunc_Array_Get_Item) == 0x001260, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_DynamicCast_AsBPI_Mission_Planning) == 0x001268, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_DynamicCast_AsBPI_Mission_Planning' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, K2Node_DynamicCast_bSuccess_2) == 0x001278, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x001280, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x001288, "Member 'W_PreMission_Tablet_C_ExecuteUbergraph_W_PreMission_Tablet::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
